import sqlite3
from tkinter import *
from tkinter import messagebox
from functools import total_ordering
import re
 
conn=sqlite3.connect("PPS.db")
 
conn.execute('''Create Table IF NOT EXISTS Client
             (ClientID         TEXT NOT NULL,
              Title             TEXT (4)            NOT NULL,
              Forname           TEXT (15)           NOT NULL,
              Surname           TEXT (15)           NOT NULL,
              DateofBirth     TEXT (10)           NOT NULL,
              Address           TEXT (20)           NOT NULL,
              Postcode          TEXT (8)            NOT NULL,
              City         TEXT (15)           NOT NULL,
              ContactNumber     TEXT (11)           NOT NULL,
              ContactEmail      TEXT (25)           NOT NULL,
              PRIMARY KEY (ClientID)
              );''')
 
conn.execute('''Create Table IF NOT EXISTS Invoice
             (InvoiceID         TEXT      NOT NULL,
              ClientID            TEXT         NOT NULL,
              Address           TEXT (20)           NOT NULL,
              IssueDate          TEXT (10)            NOT NULL,
              DueDate         TEXT (10)           NOT NULL,
              SalesCode       TEXT (6)           NOT NULL,
              Quantity     INTEGER           NOT NULL,
              Description     TEXT(20)     NOT NULL,
              Rate      INTEGER           NOT NULL,
              TotalAmountDue   INTEGER   NOT NULL,
              PRIMARY KEY (InvoiceID)
              FOREIGN KEY (ClientID) REFERENCES Client(ClientID)
              );''')
 
conn.execute('''Create Table IF NOT EXISTS Supplier
             (SupplierID        TEXT     NOT NULL,
              SupplierName      TEXT(20)    NOT NULL,
              Address           TEXT(30)    NOT NULL,
              Postcode           TEXT(8)    NOT NULL,
              City              TEXT(20)    NOT NULL,
              ContactTitle      TEXT(4)    NOT NULL,
              ContactName    TEXT(30)    NOT NULL,
              ContactNumber     INT(11)     NOT NULL,
              ContactEmail      TEXT(25)    NOT NULL,
              PRIMARY KEY(SupplierID)
              );''')
 
conn.execute('''Create Table IF NOT EXISTS Purchases
            (PurchaseID  TEXT      NOT NULL,
            SupplierID      TEXT     NOT NULL,
            ClientID        TEXT(6)     NOT NULL,
            IssueDate       TEXT(10)    NOT NULL,
            DueDate         TEXT(10)    NOT NULL,
            PurchaseCode    TEXT(6)     NOT NULL,
            Description     TEXT(20)    NOT NULL,
            Total           INTEGER     NOT NULL,
            PRIMARY KEY(PurchaseID)
            FOREIGN KEY(SupplierID) REFERENCES Supplier(SupplierID)
            FOREIGN KEY(ClientID) REFERENCES Client(ClientID)
            );''')
 
conn.execute('''Create Table IF NOT EXISTS Transactions
             (TransactionID TEXT     NOT NULL,
              InvoiceID     TEXT      NOT NULL,
              Made          INTEGER     NOT NULL,
              PurchaseID    TEXT      NOT NULL,
              Spent         INTEGER     NOT NULL,
              Profit        INTEGER     NOT NULL,
              PRIMARY KEY(TransactionID)
              FOREIGN KEY(InvoiceID) REFERENCES Invoice(InvoiceID)
              FOREIGN KEY(PurchaseID) REFERENCES Purchases(PurchaseID)
              );''')
 
conn.execute('''Create Table IF NOT EXISTS Stock
            (StockID             TEXT     NOT NULL,
            StockName           TEXT(20)    NOT NULL,
            StockAmount         INTEGER     NOT NULL,
            StockPricePerUnit   TEXT     NOT NULL,
            PRIMARY KEY(StockID)
            );''')
 
conn.execute('''Create Table IF NOT EXISTS PartsUsed
            (StockID                TEXT     NOT NULL,
            StockNameUsed            TEXT    NOT NULL,
            StockAmountUsed        INTEGER      NOT NULL,
            PricePerUnit       TEXT     NOT NULL,
            TransactionID          TEXT,      
            PRIMARY KEY(StockID, TransactionID)
            FOREIGN KEY(StockID) REFERENCES Stock(StockID)
            FOREIGN KEY(TransactionID) REFERENCES Transactions(TransactionsID)
            );''')
conn.commit()
conn.close()
 
def addnewClient():
    checkvalidated = validateClientAdd()
    
    if checkvalidated:
        ClientID = IDEnter_Var.get()
        Title = TitleEnter_Var.get()
        Forname = ForeNameEnter_Var.get()
        Surname = SurNameEnter_Var.get()
        DateofBirth = DOBEnter_Var.get()
        Address = AddressEnter_Var.get()
        Postcode = PostCodeEnter_Var.get()
        City = CityEnter_Var.get()
        ContactNumber = TelephoneEnter_Var.get()
        ContactEmail = EmailEnter_Var.get()
 
        conn = sqlite3.connect("PPS.db")
        cursor =conn.cursor()
        cursor.execute("INSERT INTO CLIENT VALUES (?,?,?,?,?,?,?,?,?,?)", (ClientID,Title,Forname,Surname,DateofBirth,Address,Postcode,City,ContactNumber,ContactEmail))
        conn.commit()
        conn.close()
 
        CustEdBox.insert( 0, Forname + " " + Surname + " Has been saved as record" )
        
    return
 
def SearchClientSurname():
 
    Surname=SurnameEnter_Var.get()
 
 
    j=0
    conn = sqlite3.connect("PPS.db")
    cursor=conn.cursor()
    user_name=Surname
 
    cursor.execute('''SELECT ClientID,Title,Forname,Surname,DateofBirth,Address,Postcode,City,ContactNumber,ContactEmail FROM Client WHERE Surname=?''', (user_name,))
    user1=cursor.fetchall()
 
    for i in user1:
        CustSearchBox.insert( 0,str( str(user1[j])))
        j+=1
 
    conn.close()
 
def SearchClientCity():
 
    City=CityEnter_Var.get()
 
 
    j=0
    conn = sqlite3.connect("PPS.db")
    cursor=conn.cursor()
    user_city=City
 
    cursor.execute('''SELECT ClientID,Title,Forname,Surname,DateofBirth,Address,Postcode,City,ContactNumber,ContactEmail FROM Client WHERE City=?''', (user_city,))
    user1=cursor.fetchall()
 
    for i in user1:
        CustSearchBox.insert( 0,str( str(user1[j])))
        j+=1
 
    conn.close()
 
def SearchClientID():
    
    chechvalidated = validateClientSearchID()
    
    if chechvalidated:
 
        ID=IDSearch_Var.get()
 
 
        j=0
        conn = sqlite3.connect("PPS.db")
        cursor=conn.cursor()
        user_id=ID
 
        cursor.execute('''SELECT ClientID,Title,Forname,Surname,DateofBirth,Address,Postcode,City,ContactNumber,ContactEmail FROM Client WHERE ClientID=?''', (user_id,))
        user1=cursor.fetchall()
 
        for i in user1:
            CustSearchBox.insert( 0,str( str(user1[j])))
            j+=1
 
            conn.close()
    return
def ResetCustSearchBox():
 
    CustSearchBox.delete(0,END)

def UpdateCust():
    
    chechvalidated = validateClientSearch()
    if chechvalidated:
        ClientID=IDEnter_Var.get()
        City=CityEnter_Var.get()
        Postcode=PostCodeEnter_Var.get()
        Address=AddressEnter_Var.get()
        ContactNumber=TelephoneEnter_Var.get()
        ContactEmail=EmailEnter_Var.get()
    
     
        conn=sqlite3.connect('PPS.db')
        cursor=conn.cursor()
        cursor.execute('''UPDATE Client SET City = ? WHERE ClientID = ?''',(City,ClientID))
        cursor.execute('''UPDATE Client SET Postcode = ? WHERE ClientID = ?''',(Postcode,ClientID))
        cursor.execute('''UPDATE Client SET Address = ? WHERE ClientID = ?''',(Address,ClientID))
        cursor.execute('''UPDATE Client SET ContactNumber = ? WHERE ClientID = ?''',(ContactNumber,ClientID))
        cursor.execute('''UPDATE Client SET ContactEmail = ? WHERE ClientID = ?''',(ContactEmail,ClientID))
        conn.commit()
        conn.close
    
        CustEdBox.insert( 0, "Record with ID: " + ClientID + ", Has been Updated"  )
    return

def DeleteCust():
 
    
    chechvalidated = validateClientDel()
    
    if chechvalidated:
        conn = sqlite3.connect('PPS.db')
 
        ClientID=IDEnter_Var.get()
 
        sql = "DELETE FROM Client WHERE ClientID=?"
 
        cursor = conn.cursor()
 
        cursor.execute(sql, (ClientID,))
 
        conn.commit()
        conn.close()
        CustEdBox.insert(0, "Record with ID: " + ClientID + ", Has been Deleted" )
    return

def DelCustConfirm():
 
    Delcustconfirm = Toplevel()
    Delcustconfirm.geometry("400x200")
    Delcustconfirm.config(bg="#aedaf0")
 
    Prompt = Label(Delcustconfirm,text = "WARNING, PRESSING CONFIRM WILL DELETE THIS RECORD")
    Prompt.config(bg="white")
    Prompt.place(x=0,y=0, width = 400, height = 100)
 
    Confirm = Button(Delcustconfirm, text = "CONFIRM", command = lambda: [DeleteCust(),Delcustconfirm.destroy() ])
    Confirm.configure(bg="green")
    Confirm.place(x=0,y=100,width = 200, height =100)
 
    Deny = Button(Delcustconfirm, text = "DENY", command = lambda: [ DelCancel(),  Delcustconfirm.destroy()])
    Deny.configure(bg="red")
    Deny.place(x=200,y=100,width=200,height=100)
 
def DelCancel():
 
        CustEdBox.insert(0, "Record has Not Been Deleted" )
 
#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 
def AddSupp():
 
    
    chechvalidated = validateSupplierAdd()
    
    if chechvalidated:
        SupplierID = SupID_Var.get()
        SupplierName = SupName_Var.get()
        Address = SupAddress_Var.get()
        Postcode = SupPostcode_Var.get()
        City = SupCity_Var.get()
        ContactTitle = SupTitle_Var.get()
        ContactName = SupConName_Var.get()
        ContactNumber = SupTelephone_Var.get()
        ContactEmail = SupEmail_Var.get()
 
        conn = sqlite3.connect("PPS.db")
        cursor =conn.cursor()
        cursor.execute("INSERT INTO Supplier VALUES (?,?,?,?,?,?,?,?,?)", (SupplierID,SupplierName,Address,Postcode,City,ContactTitle,ContactName,ContactNumber,ContactEmail))
        conn.commit()
        conn.close()
 
        SupEditBox.insert( 0, "Supplier: " +SupplierName + ", Contact: " + ContactName + ", Has been saved as record" )
    return
def DelSupp():
    chechvalidated = validateSupplierDel()
    
    if chechvalidated:
        conn = sqlite3.connect('PPS.db')
 
        SupplierID = SupID_Var.get()
 
        sql = "DELETE FROM Supplier WHERE SupplierID=?"
 
        cursor = conn.cursor()
 
        cursor.execute(sql, (SupplierID,))
 
        conn.commit()
        conn.close()
        SupEditBox.insert(0, "Record with ID: " + SupplierID + ", Has been Deleted" )
    return
def DelSuppConfirm():
 
    Delcustconfirm = Toplevel()
    Delcustconfirm.geometry("400x200")
    Delcustconfirm.config(bg="#aedaf0")
 
    Prompt = Label(Delcustconfirm,text = "WARNING, PRESSING CONFIRM WILL DELETE THIS RECORD")
    Prompt.config(bg="white")
    Prompt.place(x=0,y=0, width = 400, height = 100)
 
    Confirm = Button(Delcustconfirm, text = "CONFIRM", command = lambda: [DelSupp(),Delcustconfirm.destroy() ])
    Confirm.configure(bg="green")
    Confirm.place(x=0,y=100,width = 200, height =100)
 
    Deny = Button(Delcustconfirm, text = "DENY", command = lambda: [ DelSuppCancel(),  Delcustconfirm.destroy()])
    Deny.configure(bg="red")
    Deny.place(x=200,y=100,width=200,height=100)
 
def DelSuppCancel():
 
    SupEditBox.insert(0, "Record has Not Been Deleted" )
 
def UpdateSupp():
    chechvalidated = validateSupplierAmend()
    
    if chechvalidated:
 
        conn=sqlite3.connect('PPS.db')
        cursor=conn.cursor()
 
        SupplierID = SupID_Var.get()
        ContactTitle=SupTitle_Var.get()
        ContactName=SupConName_Var.get()
        ContactNumber=SupTelephone_Var.get()
        ContactEmail = SupEmail_Var.get()
 
        cursor.execute('''UPDATE Supplier SET ContactEmail = ? WHERE SupplierID = ?''',(ContactEmail,SupplierID))
        cursor.execute('''UPDATE Supplier SET ContactNumber = ? WHERE SupplierID = ?''',(ContactNumber,SupplierID))
        cursor.execute('''UPDATE Supplier SET ContactName = ? WHERE SupplierID = ?''',(ContactName,SupplierID))
        cursor.execute('''UPDATE Supplier SET ContactTitle = ? WHERE SupplierID = ?''',(ContactTitle,SupplierID))
 
        conn.commit()
        conn.close
 
        SupEditBox.insert(0, "Record with ID: " + SupplierID + ", Has been Updated" )
    return

def SearchSupplierCity():
 
    City=CitySearchSupp_Var.get()
 
 
    j=0
    conn = sqlite3.connect("PPS.db")
    cursor=conn.cursor()
    user_city=City
 
    cursor.execute('''SELECT SupplierID,SupplierName,Address,Postcode,City,ContactTitle,ContactName,ContactNumber,ContactEmail FROM Supplier WHERE City=?''', (user_city,))
    user1=cursor.fetchall()
 
    for i in user1:
        SuppSearchBox.insert( 0,str( str(user1[j])))
        j+=1
 
    conn.close()
 
def SearchSupplierID():
 
 
    chechvalidated = validateSupplierSearchID()
    
    if chechvalidated:
        ID=IDSearchSupp_Var.get()
 
 
        j=0
        conn = sqlite3.connect("PPS.db")
        cursor=conn.cursor()
        user_id=ID
 
        cursor.execute('''SELECT SupplierID,SupplierName,Address,Postcode,City,ContactTitle,ContactName,ContactNumber,ContactEmail FROM Supplier WHERE SupplierID=?''', (user_id,))
        user1=cursor.fetchall()
 
        for i in user1:
            SuppSearchBox.insert( 0,str( str(user1[j])))
            j+=1
 
            conn.close()
    return
def SearcSupliername():
 
    Surname=NameSearchSupp_Var.get()
 
 
    j=0
    conn = sqlite3.connect("PPS.db")
    cursor=conn.cursor()
    user_id=Surname
 
    cursor.execute('''SELECT SupplierID,SupplierName,Address,Postcode,City,ContactTitle,ContactName,ContactNumber,ContactEmail FROM Supplier WHERE ContactName=?''', (user_id,))
    user1=cursor.fetchall()
 
    for i in user1:
        SuppSearchBox.insert( 0,str( str(user1[j])))
        j+=1
 
    conn.close()
 
def ResetSuppSearchBox():
     
        SuppSearchBox.delete(0,END)
#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 
def Addinv():
 
    chechvalidated = InvoicevalAdd()
    
    if chechvalidated:
        InvoiceID = InvID_Var.get()
        CustomerID = InvCustID_Var.get()
        Address = InvAddress_Var.get()
        IssueDate = InvDate_Var.get()
        DueDate = InvDueDate_Var.get()
        SalesCode = InvSalesCode_Var.get()
        Quantity = InvQuantity_Var.get()
        Description = InvDescription_Var.get()
        Rate = InvRate_Var.get()
        Total = InvTotal
 
        conn = sqlite3.connect("PPS.db")
        cursor =conn.cursor()
        cursor.execute("INSERT INTO Invoice VALUES (?,?,?,?,?,?,?,?,?,?)", (InvoiceID,CustomerID,Address,IssueDate,DueDate,SalesCode,Quantity,Description,Rate,Total))
        conn.commit()
        conn.close()
 
        InvEdBox.insert( 0, "Invoice ID: " +InvoiceID + ", Customer ID: " + CustomerID + ", Has been saved as record" )
    return
def CalcInvTot():
     
    global InvTotal
     
    Rate = InvRate_Var.get()
    Quantity = InvQuantity_Var.get()
     
    InvTotal = Rate*Quantity
     
    InvTotBox.insert(0,InvTotal)
     
##ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦
 
def DelInv():
 
    chechvalidated = InvoicevalDel()
    
    if chechvalidated:
        conn = sqlite3.connect('PPS.db')
 
        InvoiceID = InvID_Var.get()
 
        sql = "DELETE FROM Invoice WHERE InvoiceID=?"
 
        cursor = conn.cursor()
 
        cursor.execute(sql, (InvoiceID,))
 
        conn.commit()
        conn.close()
        InvEdBox.insert(0, "Record with ID: " + InvoiceID + ", Has been Deleted" )
    return
def DelInvConfirm():
 
    Delinvconfirm = Toplevel()
    Delinvconfirm.geometry("400x200")
    Delinvconfirm.config(bg="#aedaf0")
 
    Prompt = Label(Delinvconfirm,text = "WARNING, PRESSING CONFIRM WILL DELETE THIS RECORD")
    Prompt.config(bg="white")
    Prompt.place(x=0,y=0, width = 400, height = 100)
 
    Confirm = Button(Delinvconfirm, text = "CONFIRM", command = lambda: [DelInv(),Delinvconfirm.destroy() ])
    Confirm.configure(bg="green")
    Confirm.place(x=0,y=100,width = 200, height =100)
 
    Deny = Button(Delinvconfirm, text = "DENY", command = lambda: [ DelInvCancel(),  Delinvconfirm.destroy()])
    Deny.configure(bg="red")
    Deny.place(x=200,y=100,width=200,height=100)
 
def DelInvCancel():
 
    InvEdBox.insert(0, "Record has Not Been Deleted" )
 
def UpdateInv():
 

    chechvalidated = InvoicevalUpdate()
    
    if chechvalidated:
        conn=sqlite3.connect('PPS.db')
        cursor=conn.cursor()
 
        InvoiceID = InvID_Var.get()
        IssueDate = InvDate_Var.get()
        DueDate = InvDueDate_Var.get()
        SalesCode = InvSalesCode_Var.get()
        Description = InvDescription_Var.get()
 
        cursor.execute('''UPDATE Invoice SET Description = ? WHERE InvoiceID = ?''',(Description,InvoiceID))
        cursor.execute('''UPDATE Invoice SET SalesCode = ? WHERE InvoiceID = ?''',(SalesCode,InvoiceID))
        cursor.execute('''UPDATE Invoice SET DueDate = ? WHERE InvoiceID = ?''',(DueDate,InvoiceID))
        cursor.execute('''UPDATE Invoice SET IssueDate = ? WHERE InvoiceID = ?''',(IssueDate,InvoiceID))
 
        conn.commit()
        conn.close
 
        InvEdBox.insert(0, "Record with ID: " + InvoiceID + ", Has been Updated" )

    return
def SearchIDInv():
    chechvalidated = InvoicevalSearchinvID()
    
    if chechvalidated:     
        InvoiceID = IDSearchInv_Var.get()
 
 
        j=0
        conn = sqlite3.connect("PPS.db")
        cursor=conn.cursor()
        user_id=InvoiceID
 
        cursor.execute('''SELECT InvoiceID,ClientID,Address,IssueDate,DueDate,SalesCode,Quantity,Description,Rate,TotalAmountDue FROM Invoice WHERE InvoiceID=?''', (user_id,))
        user1=cursor.fetchall()
 
        for i in user1:
            InvSearchBox.insert( 0,str( str(user1[j])))
            j+=1
 
        conn.close()
    return
def SearchCustIDInv():
     
    chechvalidated = InvoicevalSearchCustID()
    
    if chechvalidated:
        CustomerID = CustIDSearchInv_Var.get()
 
        j=0
        conn = sqlite3.connect("PPS.db")
        cursor=conn.cursor()
        user_id=CustomerID
 
        cursor.execute('''SELECT InvoiceID,ClientID,Address,IssueDate,DueDate,SalesCode,Quantity,Description,Rate,TotalAmountDue FROM Invoice WHERE ClientID=?''', (user_id,))
        user1=cursor.fetchall()
        for i in user1:
            InvSearchBox.insert( 0,str( str(user1[j])))
            j+=1
 
        conn.close()
    return
def SearchSCInv():
     
    SalesCode = SalesCodeSearchInv_Var.get()
 
 
    j=0
    conn = sqlite3.connect("PPS.db")
    cursor=conn.cursor()
    user_code=SalesCode
 
    cursor.execute('''SELECT InvoiceID,ClientID,Address,IssueDate,DueDate,SalesCode,Quantity,Description,Rate,TotalAmountDue FROM Invoice WHERE SalesCode=?''', (user_code,))
    user1=cursor.fetchall()
 
    for i in user1:
        InvSearchBox.insert( 0,str( str(user1[j])))
        j+=1
 
    conn.close()
 
def ResetinvCalcBox():
 
    InvTotBox.delete(0,END)
     
def ResetInvSearchBox():
     
    InvSearchBox.delete(0,END)
 
def AddPur():
     
     
    chechvalidated = PurchaseValAdd()
    
    if chechvalidated:
        PurchaseID = PurID_Var.get()
        SupplierID = PurSupID_Var.get()
        CustomerID = PurCustID_Var.get()
        IssueDate = PurDate_Var.get()
        DueDate = PurDueDate_Var.get()
        PurchaseCode = PurCode_Var.get()
        Description = PurDescription_Var.get()
        Total = PurTotal_Var.get()
 
        conn = sqlite3.connect("PPS.db")
        cursor =conn.cursor()
        cursor.execute("INSERT INTO Purchases VALUES (?,?,?,?,?,?,?,?)", (PurchaseID,SupplierID,CustomerID,IssueDate,DueDate,PurchaseCode,Description,Total))
        conn.commit()
        conn.close()
 
        PurEditBox.insert( 0, "Purchase ID: " +PurchaseID +", Supplier ID:"+ SupplierID + ", Customer ID: " + CustomerID + ", Has been saved as record" )
    return
def DelPur():
     
    chechvalidated = PurchaseValDel()
    
    if chechvalidated:
        conn = sqlite3.connect('PPS.db')
 
        PurchaseID = PurID_Var.get()
 
        sql = "DELETE FROM Purchases WHERE PurchaseID=?"
 
        cursor = conn.cursor()
 
        cursor.execute(sql, (PurchaseID,))
 
        conn.commit()
        conn.close()
        PurEditBox.insert(0, "Record with ID: " + PurchaseID + ", Has been Deleted" )
    return
def DelPurConfirm():
 
    Delpurconfirm = Toplevel()
    Delpurconfirm.geometry("400x200")
    Delpurconfirm.config(bg="#aedaf0")
 
    Prompt = Label(Delpurconfirm,text = "WARNING, PRESSING CONFIRM WILL DELETE THIS RECORD")
    Prompt.config(bg="white")
    Prompt.place(x=0,y=0, width = 400, height = 100)
 
    Confirm = Button(Delpurconfirm, text = "CONFIRM", command = lambda: [DelPur(),Delpurconfirm.destroy() ])
    Confirm.configure(bg="green")
    Confirm.place(x=0,y=100,width = 200, height =100)
 
    Deny = Button(Delpurconfirm, text = "DENY", command = lambda: [ DelPurCancel(),  Delpurconfirm.destroy()])
    Deny.configure(bg="red")
    Deny.place(x=200,y=100,width=200,height=100)
 
def DelPurCancel():
 
    InvEdBox.insert(0, "Record has Not Been Deleted" )
 
def UpdatePur():
    chechvalidated = PurchaseValUpdate()
    
    if chechvalidated:
        conn=sqlite3.connect('PPS.db')
        cursor=conn.cursor()
 
        PurchaseID = PurID_Var.get()
        IssueDate = PurDate_Var.get()
        DueDate = PurDueDate_Var.get()
        PurchaseCode = PurCode_Var.get()
        Description = PurDescription_Var.get()
        Total = PurTotal_Var.get()
 
        cursor.execute('''UPDATE Purchases SET Total = ? WHERE PurchaseID = ?''',(Total,PurchaseID))
        cursor.execute('''UPDATE Purchases SET Description = ? WHERE PurchaseID = ?''',(Description,PurchaseID))
        cursor.execute('''UPDATE Purchases SET PurchaseCode = ? WHERE PurchaseID = ?''',(PurchaseCode,PurchaseID))
        cursor.execute('''UPDATE Purchases SET DueDate = ? WHERE PurchaseID = ?''',(DueDate,PurchaseID))
        cursor.execute('''UPDATE Purchases SET IssueDate = ? WHERE PurchaseID = ?''',(IssueDate,PurchaseID))
 
        conn.commit()
        conn.close
 
        PurEditBox.insert(0, "Record with ID: " + PurchaseID + ", Has been Updated" )
    return

def SearchIDPur():
     
    chechvalidated = PurchaseValSearchPur()
    
    if chechvalidated:
        PurchaseID = IDSearchPur_Var.get()
 
 
        j=0
        conn = sqlite3.connect("PPS.db")
        cursor=conn.cursor()
        user_id=PurchaseID
 
        cursor.execute('''SELECT PurchaseID,SupplierID,ClientID,IssueDate,DueDate,PurchaseCode,Description,Total FROM Purchases WHERE PurchaseID=?''', (user_id,))
        user1=cursor.fetchall()
 
        for i in user1:
            PurSearchBox.insert( 0,str( str(user1[j])))
            j+=1
 
            conn.close()
    return
def SearchCustIDPur():
    chechvalidated = PurchaseValSearchCust()
    
    if chechvalidated:
        CustomerID = CustIDSearchPur_Var.get()
 
 
        j=0
        conn = sqlite3.connect("PPS.db")
        cursor=conn.cursor()
        user_id=CustomerID
        print(user_id)
        cursor.execute('''SELECT PurchaseID,SupplierID,ClientID,IssueDate,DueDate,PurchaseCode,Description,Total FROM Purchases WHERE ClientID=?''', (user_id,))
        user1=cursor.fetchall()
        print(user1)
        for i in user1:
            PurSearchBox.insert( 0,str( str(user1[j])))
            j+=1
 
            conn.close()
    return
def SearchPCPur():
     
    PurchaseCode = PurCodeSearchPur_Var.get()
 
 
    j=0
    conn = sqlite3.connect("PPS.db")
    cursor=conn.cursor()
    user_code=PurchaseCode
 
    cursor.execute('''SELECT PurchaseID,SupplierID,ClientID,IssueDate,DueDate,PurchaseCode,Description,Total FROM Purchases WHERE PurchaseCode=?''', (user_code,))
    user1=cursor.fetchall()
 
    for i in user1:
        PurSearchBox.insert( 0,str( str(user1[j])))
        j+=1
 
    conn.close()
 
def ResetPurCalcBox():
 
    PurSearchBox.delete(0,END)
 
def Addtransaction():
     
    chechvalidated = TransactionValAdd()
    
    if chechvalidated: 
        TransactionID = TranID_Var.get()
        InvoiceID = TranInvID_Var.get()
        Made = TranMade_Var.get()
        PurchaseID = TranPurID_Var.get()
        Spent = TranPurID_Var.get()
        Profit = TranProfit
 
 
        conn = sqlite3.connect("PPS.db")
        cursor =conn.cursor()
        cursor.execute("INSERT INTO Transactions VALUES (?,?,?,?,?,?)", (TransactionID,InvoiceID,Made,PurchaseID,Spent,Profit))
        conn.commit()
        conn.close()
 
        TranEditBox.insert( 0, "Transaction ID: " +TransactionID +", Invoice ID:"+ InvoiceID + ", Purchase ID: " + PurchaseID + ", Has been saved as record" )
    return
def ResetTranCalcBox():
    TranProfitBox.delete(0, END)
 
def CalcProfit():
    global TranProfit
     
    Made = TranMade_Var.get()
    Spent = TranSpent_Var.get()
     
    TranProfit = Made-Spent
     
    TranProfitBox.insert(0,TranProfit)
 
def DelTran():
    
    chechvalidated = TransactionValDel()
    
    if chechvalidated:
     
        conn = sqlite3.connect('PPS.db')
 
        TransactionID = TranID_Var.get()
 
        sql = "DELETE FROM Transactions WHERE TransactionID=?"
 
        cursor = conn.cursor()
 
        cursor.execute(sql, (TransactionID,))
 
        conn.commit()
        conn.close()
        TranEditBox.insert(0, "Record with ID: " + TransactionID + ", Has been Deleted" )
    return
def DelTranConfirm():
 
    Deltranconfirm = Toplevel()
    Deltranconfirm.geometry("400x200")
    Deltranconfirm.config(bg="#aedaf0")
 
    Prompt = Label(Deltranconfirm,text = "WARNING, PRESSING CONFIRM WILL DELETE THIS RECORD")
    Prompt.config(bg="white")
    Prompt.place(x=0,y=0, width = 400, height = 100)
 
    Confirm = Button(Deltranconfirm, text = "CONFIRM", command = lambda: [DelTran(),Deltranconfirm.destroy() ])
    Confirm.configure(bg="green")
    Confirm.place(x=0,y=100,width = 200, height =100)
 
    Deny = Button(Deltranconfirm, text = "DENY", command = lambda: [ DelTranCancel(),  Deltranconfirm.destroy()])
    Deny.configure(bg="red")
    Deny.place(x=200,y=100,width=200,height=100)
 
def DelTranCancel():
 
    TranEditBox.insert(0, "Record has Not Been Deleted" )
 
def ResetTranSearchbox():
     
    TranSearchBox.delete(0,END)
 
def SearchIDTran():
    chechvalidated = TransactionValSearchTranID()
    
    if chechvalidated:
        
        TransactionID = IDSearchTran_Var.get()
 
 
        j=0
        conn = sqlite3.connect("PPS.db")
        cursor=conn.cursor()
        user_id=TransactionID
 
        cursor.execute('''SELECT TransactionID,InvoiceID,Made,PurchaseID,Spent,Profit FROM Transactions WHERE TransactionID=?''', (user_id,))
        user1=cursor.fetchall()
 
        for i in user1:
            TranSearchBox.insert( 0,str( str(user1[j])))
            j+=1
 
            conn.close()
    return
def SearchInvoiceIDTran():
    chechvalidated = TransactionValSearchInvID()
    
    if chechvalidated: 
        InvoiceID = InvoiceIDSearchTran_Var.get()
 
 
        j=0
        conn = sqlite3.connect("PPS.db")
        cursor=conn.cursor()
        user_id=InvoiceID
 
        cursor.execute('''SELECT TransactionID,InvoiceID,Made,PurchaseID,Spent,Profit FROM Transactions WHERE InvoiceID=?''', (user_id,))
        user1=cursor.fetchall()
 
        for i in user1:
            TranSearchBox.insert( 0,str( str(user1[j])))
            j+=1
 
            conn.close()
    return
def SearchPurchaseIDTran():
    chechvalidated = TransactionValSearchPurID()
    
    if chechvalidated: 
        PurchaseID = PurchaseIDEnterSearchTran_Var.get()
 
 
        j=0
        conn = sqlite3.connect("PPS.db")
        cursor=conn.cursor()
        user_code=PurchaseID
 
        cursor.execute('''SELECT TransactionID,InvoiceID,Made,PurchaseID,Spent,Profit FROM Transactions WHERE PurchaseID=?''', (user_code,))
        user1=cursor.fetchall()
 
        for i in user1:
            TranSearchBox.insert( 0,str( str(user1[j])))
            j+=1
 
            conn.close()
    return
def AddStockItem():
    chechvalidated = StockIDValAdd()
    
    if chechvalidated:
        AddStockItemSTOCK()
        AddStockItemUSED()
    return
def DelStockItem():
    chechvalidated = StockIDValAdd()
    
    if chechvalidated: 
        conn = sqlite3.connect('PPS.db')
 
        StockID = StockID_Var.get()
 
        sql = "DELETE FROM Stock WHERE StockID = ?"
        cursor = conn.cursor()
 
        cursor.execute(sql, (StockID,))
 
        conn.commit()
        conn.close()
        StockEditBox.insert(0, "Record with ID: " + StockID + ", Has been Deleted" )
    return
def DelStockConfirm():
 
    DelStockconfirm = Toplevel()
    DelStockconfirm.geometry("400x200")
    DelStockconfirm.config(bg="#aedaf0")
 
    Prompt = Label(DelStockconfirm,text = "WARNING, PRESSING CONFIRM WILL DELETE THIS RECORD")
    Prompt.config(bg="white")
    Prompt.place(x=0,y=0, width = 400, height = 100)
 
    Confirm = Button(DelStockconfirm, text = "CONFIRM", command = lambda: [DelStockItem(),DelStockconfirm.destroy() ])
    Confirm.configure(bg="green")
    Confirm.place(x=0,y=100,width = 200, height =100)
 
    Deny = Button(DelStockconfirm, text = "DENY", command = lambda: [ DelStockItem(),  DelStockconfirm.destroy()])
    Deny.configure(bg="red")
    Deny.place(x=200,y=100,width=200,height=100)
 
def DelTranCancel():
 
    StockEditBox.insert(0, "Record has Not Been Deleted" )
        
def AddStockItemUSED():
     
    StockID = StockID_Var.get()
    StockName = StockName_Var.get()
    StockAmount = 0
    StockPPU = StockPPU_Var.get()
    Blank = ""
 
 
 
    conn = sqlite3.connect("PPS.db")
    cursor =conn.cursor()
    cursor.execute("INSERT INTO PartsUsed VALUES (?,?,?,?,?)", (StockID,StockName,StockAmount,StockPPU,Blank))
    conn.commit()
    conn.close()
 
    StockEditBox.insert( 0, "Stock ID: " +StockID +", Stock Name:"+ StockName + ", Stock price per Unit: " + StockPPU + ", Has been saved as Item" )
 
def AddStockItemSTOCK():
     
    StockID = StockID_Var.get()
    StockName = StockName_Var.get()
    StockAmount = 0
    StockPPU = StockPPU_Var.get()
    StockPPU = str(StockPPU)
    StockPPU = "£" + StockPPU
     
    conn = sqlite3.connect("PPS.db")
    cursor =conn.cursor()
    cursor.execute("INSERT INTO Stock VALUES (?,?,?,?)", (StockID,StockName,StockAmount,StockPPU))
    conn.commit()
    conn.close()
 
 
def AddtoStockItem(stock_ID):
     
    chechvalidated = StockIDValAdd()
    
    if chechvalidated:
        user_code = stock_ID
 
        Number = PadBox.get()
        Number = int(Number)
 
        conn = sqlite3.connect("PPS.db")
        cursor = conn.cursor()
        cursor.execute('''SELECT StockAmount FROM Stock WHERE StockID = ?''', (user_code,))
        for records in cursor:
            amount = records[0]
     
 
 
        prevamount= str(amount)     
        amount = amount + Number
        newamount = str(amount) 
 
        cursor.execute('''UPDATE Stock SET StockAmount = ? WHERE StockID = ? ''',(amount, user_code,))
        StockEditBox.insert(0, "Item: " + user_code + ", Has had its stock amount changed from: " + prevamount + ", To: " + newamount)
     
 
        conn.commit()
        conn.close()
    return
def TakefromStockItem(stock_ID):
 
    chechvalidated = StockIDValAdd()
    
    if chechvalidated:
 
        user_code = stock_ID
 
        Number = PadBox.get()
        Number = int(Number)
 
        conn = sqlite3.connect("PPS.db")
        cursor = conn.cursor()
        cursor.execute('''SELECT StockAmount FROM Stock WHERE StockID = ?''', (user_code,))
        for records in cursor:
            amount = records[0]
     
 
        prevamount= str(amount)
        amount = amount - Number
        newamount = str(amount)
     
        cursor.execute('''UPDATE Stock SET StockAmount = ? WHERE StockID = ? ''',(amount, user_code,))
        StockEditBox.insert(0, "Item: " + user_code + ", Has had its stock amount changed from: " + prevamount + ", To: " + newamount)
 
        conn.commit()
        conn.close()
    return
def UpdateStockPPU():
    chechvalidated = StockIDValAdd()
    
    if chechvalidated:
        conn=sqlite3.connect('PPS.db')
        cursor=conn.cursor()
 
        StockID = StockID_Var.get()
        StockPPU = StockPPU_Var.get()
        StockPPU ="£" + StockPPU
        cursor.execute('''UPDATE Stock SET StockPricePerUnit = ? WHERE StockID = ?''',(StockPPU,StockID))
        cursor.execute('''UPDATE PartsUsed SET PricePerUnit = ? WHERE StockID = ?''',(StockPPU,StockID))
     
        StockEditBox.insert(0, "Stock number: " +StockID+ ", Has been Updated to the Price per Unit of: " + StockPPU)
 
        conn.commit()
        conn.close
    return
def ResetStockSearchBox():
    StockSearchBox.delete(0, END)  
 
def SearchStockName():
    
    StockName = StockNameEnter_Var.get()
 
 
    j=0
    conn = sqlite3.connect("PPS.db")
    cursor=conn.cursor()
    user_name=StockName
 
    cursor.execute('''SELECT StockID,StockName,StockAmount,StockPricePerUnit FROM Stock WHERE StockName=?''', (user_name,))
    user1=cursor.fetchall()
 
    for i in user1:
        StockSearchBox.insert( 0,str( str(user1[j])))
        j+=1
 
    conn.close()
 
def SearchStockID():
    chechvalidated = StockIDValSearch()
    
    if chechvalidated:
        StockID = StockIDEnter_Var.get()
 
 
        j=0
        conn = sqlite3.connect("PPS.db")
        cursor=conn.cursor()
        user_id=StockID
 
        cursor.execute('''SELECT StockID,StockName,StockAmount,StockPricePerUnit FROM Stock WHERE StockID=?''', (user_id,))
        user1=cursor.fetchall()
 
        for i in user1:
            StockSearchBox.insert( 0,str( str(user1[j])))
            j+=1
 
            conn.close()
    return
def TransferStock(stock_id, transaction_id):
    
    chechvalidated = TransferStockVal()
    
    if chechvalidated:
        user_code = stock_id
        user_transactionid = transaction_id
        Value = TransferPadBox.get()
        Value = int(Value)
    
        conn = sqlite3.connect("PPS.db")
        cursor = conn.cursor()
        cursor.execute('''SELECT StockAmount FROM Stock WHERE StockID = ?''', (user_code,))
        for records in cursor:
            amount = records[0]
     
 
        OldValAM = str(amount)
        amount = amount - Value
        NewValAM = str(amount)
        cursor.execute('''UPDATE Stock SET StockAmount = ? WHERE StockID = ? ''',(amount, user_code,))
        cursor.execute('''SELECT StockAmountUsed FROM PartsUsed WHERE StockID = ?''', (user_code,))
        for records in cursor:
            Amount = records[0]
      
  
      
        OldVal = str(Amount)
        Amount = Amount + Value
        NewVal = str(Amount) 
  
        cursor.execute('''UPDATE PartsUsed SET StockAmountUsed = ? WHERE StockID = ? ''',(Amount, user_code,))
        cursor.execute('''UPDATE PartsUsed SET TransactionID = ? WHERE StockID = ?''',(user_transactionid,user_code))
        conn.commit()
        conn.close()
    
        StockTransferbox.insert(0, "Item with ID: " + user_code + ", Has had its stock amount reduced from: " + OldValAM +", To: " + NewValAM)
        StockTransferbox.insert(0, "Item with ID: " + user_code + ", Has had its stock amount Raised from: " + OldVal +", To: " + NewVal)
        StockTransferbox.insert(0, "Item with ID: " + user_code + ", Has had its Transaction ID updated to be: " + user_transactionid)
    return    
def UsedTransSearch():
    chechvalidated = TransactionIDSearchVal()
    
    if chechvalidated:    
        TransactionID = StockTranIDEnter_Var.get()
 
 
        j=0
        conn = sqlite3.connect("PPS.db")
        cursor=conn.cursor()
        user_id=TransactionID
 
        cursor.execute('''SELECT StockID,StockNameUsed,StockAmountUsed,PricePerUnit,TransactionID FROM PartsUsed WHERE TransactionID=?''', (user_id,))
        user1=cursor.fetchall()
 
        for i in user1:
            UsedStockSearchBox.insert( 0,str( str(user1[j])))
            j+=1
 
            conn.close()
    return
def ResetUsedStockSearchBox():
    UsedStockSearchBox.delete(0, END)     
     
def ResetTotalCostBox():
    TotalCostBox.delete(0, END)      
    TotalCostBox
  
def CalcTotal(transaction_id):
    chechvalidated = TransactionIDSearchVal()
    
    if chechvalidated: 
        user_code = transaction_id
    
        conn = sqlite3.connect("PPS.db")
        cursor = conn.cursor()
        cursor.execute('''SELECT count(*) FROM PartsUsed WHERE TransactionID = ?''',(user_code,))
        length = cursor.fetchone()
        cursor.execute('''SELECT StockID FROM PartsUsed WHERE TransactionID = ?''',(user_code,))
        array = cursor.fetchall()
        conn.close()
    
    
        amount = 0
        ppu = 0
        count = 0
        Total = 0
        Tot = 0
        Total = float(Total)
        tot = float(Tot)
        for count in range(len(array)):
        
 
        
            user_id = str(array[count])
            user_id = user_id.replace("(",'')
            user_id = user_id.replace("'",'')
            user_id = user_id.replace(")",'')
            user_id = user_id.replace(",",'')


            conn = sqlite3.connect("PPS.db")
            cursor = conn.cursor()
            cursor.execute('''SELECT StockAmountUsed FROM PartsUsed WHERE StockID = ?''', (user_id,))
            for records in cursor:
                amount = records[0]
            amount = float(amount)
                
            conn.close()
  
            conn = sqlite3.connect("PPS.db")
            cursor = conn.cursor()   
            amount = amount + 0
            cursor.execute('''SELECT PricePerUnit FROM PartsUsed WHERE StockID = ?''', (user_id,))
            for records in cursor:
                ppu = records[0]
            ppu = str(ppu)
            ppu = ppu.replace("£","")
            ppu=float(ppu)

        
            Tot = amount * ppu 

        
            Total = Total + Tot 
        

        
            conn.close() 
    
               
        Total = str(Total)
    
        TotalCostBox.insert(0, "£" + Total)  
    return    





def validateClientSearchID():
    validated=True
    if not re.match("^[A-Z]{2}[0-9]{4}$",IDSearch_Var.get()):
        messagebox.showerror("Error","Client ID has incorect FORMAT = LL0000!!")
        validated=False  
    return validated        
def validateClientDel():
    validated=True
    if not re.match("^[A-Z]{2}[0-9]{4}$",IDEnter_Var.get()):
        messagebox.showerror("Error","Client ID has incorect FORMAT = LL0000!!")
        validated=False  
    return validated 
def validateClientSearch():
    validated=True
    if not re.match("^[A-Z]{2}[0-9]{4}$",IDEnter_Var.get()):
        messagebox.showerror("Error","Client ID has incorect FORMAT = LL0000!!")
        validated=False
    if not re.match("^[A-Z]{1}[0-9]{2}[/][0-9]{1}[A-Z]{2}$",PostCodeEnter_Var.get()):
        messagebox.showerror("Error","Client Postcode has incorect FORMAT = L00/0LL!!")
        validated=False
    if not re.match("^[0-9]{11}$",TelephoneEnter_Var.get()):
        messagebox.showerror("Error","Client Phonenumber has incorect FORMAT = 00000000000!!")
        validated=False
    return validated
def validateClientAdd():
        
    validated=True
    
 
    if not re.match("^[A-Z]{2}[0-9]{4}$",IDEnter_Var.get()):
        messagebox.showerror("Error","Client ID has incorect FORMAT = LL0000!!")
        validated=False
    if not re.match("^[0-9]{2}[/][0-9]{2}[/][0-9]{4}$",DOBEnter_Var.get()):
        messagebox.showerror("Error","Client Date of Birth has incorect FORMAT = dd/mm/yyyy!!")
        validated=False
    if not re.match("^[A-Z]{1}[0-9]{2}[/][0-9]{1}[A-Z]{2}$",PostCodeEnter_Var.get()):
        messagebox.showerror("Error","Client Postcode has incorect FORMAT = L00/0LL!!")
        validated=False
    if not re.match("^[0-9]{11}$",TelephoneEnter_Var.get()):
        messagebox.showerror("Error","Client Phonenumber has incorect FORMAT = 00000000000!!")
        validated=False
    return validated

def validateSupplierAmend():
        
    validated=True
    
 
    if not re.match("^[A-Z]{2}[0-9]{4}$",SupID_Var.get()):
        messagebox.showerror("Error","Supplier ID has incorect FORMAT = LL0000!!")
        validated=False
    if not re.match("^[0-9]{11}$",SupTelephone_Var.get()):
        messagebox.showerror("Error","Supplier Phonenumber has incorect FORMAT = 00000000000!!")
        validated=False
    return validated
def validateSupplierAdd():
        
    validated=True
    
 
    if not re.match("^[A-Z]{2}[0-9]{4}$",SupID_Var.get()):
        messagebox.showerror("Error","Supplier ID has incorect FORMAT = LL0000!!")
        validated=False
    if not re.match("^[A-Z]{1}[0-9]{2}[/][0-9]{1}[A-Z]{2}$",SupPostcode_Var.get()):
        messagebox.showerror("Error","Supplier Postcode has incorect FORMAT = L00/0LL!!")
        validated=False
    if not re.match("^[0-9]{11}$",SupTelephone_Var.get()):
        messagebox.showerror("Error","Supplier Phonenumber has incorect FORMAT = 00000000000!!")
        validated=False
    return validate
def validateSupplierDel():
        
    validated=True
    
 
    if not re.match("^[A-Z]{2}[0-9]{4}$",SupID_Var.get()):
        messagebox.showerror("Error","Supplier ID has incorect FORMAT = LL0000!!")
        validated=False
    return validated
def validateSupplierSearchID():
        
    validated=True
    
 
    if not re.match("^[A-Z]{2}[0-9]{4}$",IDSearchSupp_Var.get()):
        messagebox.showerror("Error","Supplier ID has incorect FORMAT = LL0000!!")
        validated=False
    return validated

def InvoicevalAdd():
    validated=True
    
 
    if not re.match("^[A-Z]{2}[0-9]{4}$",InvID_Var.get()):
        messagebox.showerror("Error","Invoice ID has incorect FORMAT = LL0000!!")
        validated=False
    if not re.match("^[A-Z]{2}[0-9]{4}$",InvCustID_Var.get()):
        messagebox.showerror("Error","Client ID has incorect FORMAT = LL0000!!")
        validated=False
    if not re.match("^[0-9]{2}[/][0-9]{2}[/][0-9]{4}$",InvDate_Var.get()):
        messagebox.showerror("Error","Date has incorect FORMAT = dd/mm/yyyy!!")
        validated=False
    if not re.match("^[0-9]{2}[/][0-9]{2}[/][0-9]{4}$",InvDueDate_Var.get()):
        messagebox.showerror("Error","DueDate has incorect FORMAT = dd/mm/yyyy!!")
        validated=False
    return validated   
def InvoicevalDel():
    validated=True
    
 
    if not re.match("^[A-Z]{2}[0-9]{4}$",InvID_Var.get()):
        messagebox.showerror("Error","Invoice ID has incorect FORMAT = LL0000!!")
        validated=False   
    return validat
def InvoicevalUpdate():
    validated=True
    
 
    if not re.match("^[A-Z]{2}[0-9]{4}$",InvID_Var.get()):
        messagebox.showerror("Error","Invoice ID has incorect FORMAT = LL0000!!")
        validated=False
    if not re.match("^[0-9]{2}[/][0-9]{2}[/][0-9]{4}$",InvDate_Var.get()):
        messagebox.showerror("Error","Date has incorect FORMAT = dd/mm/yyyy!!")
        validated=False
    if not re.match("^[0-9]{2}[/][0-9]{2}[/][0-9]{4}$",InvDueDate_Var.get()):
        messagebox.showerror("Error","DueDate has incorect FORMAT = dd/mm/yyyy!!")
        validated=False
    return validated
def InvoicevalSearchinvID():
    validated=True
    
 
    if not re.match("^[A-Z]{2}[0-9]{4}$",IDSearchInv_Var.get()):
        messagebox.showerror("Error","Invoice ID has incorect FORMAT = LL0000!!")
        validated=False
    return validated
def InvoicevalSearchCustID():
    validated=True
    
 
    if not re.match("^[A-Z]{2}[0-9]{4}$",CustIDSearchInv_Var.get()):
        messagebox.showerror("Error","Client ID has incorect FORMAT = LL0000!!")
        validated=False
        
    return validated

def PurchaseValAdd():
    validated=True
    
 
    if not re.match("^[A-Z]{2}[0-9]{4}$",PurID_Var.get()):
        messagebox.showerror("Error","Purchase ID has incorect FORMAT = LL0000!!")
        validated=False
    if not re.match("^[A-Z]{2}[0-9]{4}$",PurSupID_Var.get()):
        messagebox.showerror("Error","Supplier ID has incorect FORMAT = LL0000!!")
        validated=False
    if not re.match("^[A-Z]{2}[0-9]{4}$",PurCustID_Var.get()):
        messagebox.showerror("Error","Client ID has incorect FORMAT = LL0000!!")
        validated=False
    if not re.match("^[0-9]{2}[/][0-9]{2}[/][0-9]{4}$",PurDate_Var.get()):
        messagebox.showerror("Error","Date has incorect FORMAT = dd/mm/yyyy!!")
        validated=False
    if not re.match("^[0-9]{2}[/][0-9]{2}[/][0-9]{4}$",PurDueDate_Var.get()):
        messagebox.showerror("Error","DueDate has incorect FORMAT = dd/mm/yyyy!!")
        validated=False
    return validated
def PurchaseValDel():
    validated=True
    
 
    if not re.match("^[A-Z]{2}[0-9]{4}$",PurID_Var.get()):
        messagebox.showerror("Error","Purchase ID has incorect FORMAT = LL0000!!")
        validated=False
    return validated
def PurchaseValUpdate():
    validated=True
    
 
    if not re.match("^[A-Z]{2}[0-9]{4}$",PurID_Var.get()):
        messagebox.showerror("Error","Purchase ID has incorect FORMAT = LL0000!!")
        validated=False
    if not re.match("^[0-9]{2}[/][0-9]{2}[/][0-9]{4}$",PurDate_Var.get()):
        messagebox.showerror("Error","Date has incorect FORMAT = dd/mm/yyyy!!")
        validated=False
    if not re.match("^[0-9]{2}[/][0-9]{2}[/][0-9]{4}$",PurDueDate_Var.get()):
        messagebox.showerror("Error","DueDate has incorect FORMAT = dd/mm/yyyy!!")
        validated=False
    return validated
def PurchaseValSearchPur():
    validated=True
    
 
    if not re.match("^[A-Z]{2}[0-9]{4}$",IDSearchPur_Var.get()):
        messagebox.showerror("Error","Purchase ID has incorect FORMAT = LL0000!!")
        validated=False
    return validated
def PurchaseValSearchCust():
    validated=True
    
 
    if not re.match("^[A-Z]{2}[0-9]{4}$",CustIDSearchPur_Var.get()):
        messagebox.showerror("Error","Customer ID has incorect FORMAT = LL0000!!")
        validated=False
    return validated

def TransactionValAdd():
    validated=True
    
 
    if not re.match("^[A-Z]{2}[0-9]{4}$",TranID_Var.get()):
        messagebox.showerror("Error","Transaction ID has incorect FORMAT = LL0000!!")
        validated=False
    if not re.match("^[A-Z]{2}[0-9]{4}$",TranInvID_Var.get()):
        messagebox.showerror("Error","Invoice ID has incorect FORMAT = LL0000!!")
        validated=False
    if not re.match("^[A-Z]{2}[0-9]{4}$",TranPurID_Var.get()):
        messagebox.showerror("Error","Purchase ID has incorect FORMAT = LL0000!!")
        validated=False

    return validated
def TransactionValDel():
    validated=True
    
 
    if not re.match("^[A-Z]{2}[0-9]{4}$",TranID_Var.get()):
        messagebox.showerror("Error","Transaction ID has incorect FORMAT = LL0000!!")
        validated=False
    return validated
def TransactionValSearchTranID():
    validated=True
    
 
    if not re.match("^[A-Z]{2}[0-9]{4}$",IDSearchTran_Var.get()):
        messagebox.showerror("Error","Transaction ID has incorect FORMAT = LL0000!!")
        validated=False
    return validated
def TransactionValSearchInvID():
    validated=True
    
 
    if not re.match("^[A-Z]{2}[0-9]{4}$",InvoiceIDSearchTran_Var.get()):
        messagebox.showerror("Error","Invoice ID has incorect FORMAT = LL0000!!")
        validated=False
    return validated
def TransactionValSearchPurID():
    validated=True
    
 
    if not re.match("^[A-Z]{2}[0-9]{4}$",PurchaseIDEnterSearchTran_Var.get()):
        messagebox.showerror("Error","Purchase ID has incorect FORMAT = LL0000!!")
        validated=False
    return validated

def StockIDValAdd():
    validated=True
    
 
    if not re.match("^[A-Z]{2}[0-9]{4}$",StockID_Var.get()):
        messagebox.showerror("Error","Stock ID has incorect FORMAT = LL0000!!")
        validated=False
    return validated
def StockIDValSearch():
    validated=True
    
 
    if not re.match("^[A-Z]{2}[0-9]{4}$",StockIDEnter_Var.get()):
        messagebox.showerror("Error","Stock ID has incorect FORMAT = LL0000!!")
        validated=False
    return validated
def TransferStockVal():
    validated=True
    
    if not re.match("^[A-Z]{2}[0-9]{4}$",StockTransferID_Var.get()):
        messagebox.showerror("Error","Stock ID has incorect FORMAT = LL0000!!")
        validated=False
    if not re.match("^[A-Z]{2}[0-9]{4}$",StockTransactionID_Var.get()):
        messagebox.showerror("Error","Transaction ID has incorect FORMAT = LL0000!!")
        validated=False
    return validated
def TransactionIDSearchVal():
    validated=True
    
 
    if not re.match("^[A-Z]{2}[0-9]{4}$",StockTranIDEnter_Var.get()):
        messagebox.showerror("Error","Transaction ID has incorect FORMAT = LL0000!!")
        validated=False
    return validated

def makeMain() :
    global logomain, logoside,home,back,Id
    Main = Toplevel()
    Main.geometry("1280x720")
    Main.config(bg="#aedaf0")
 
    Id=PhotoImage(file="ID.png")
    back=PhotoImage(file="Return.png")
    home=PhotoImage(file="Home.png")
    Financialbutton=PhotoImage(file="Financialbutton.png")
 
    Financial = Button(Main, image= Financialbutton, command = lambda: [makeFinancial(),Main.destroy()])
    Financial.configure(bg="#aeaaf0")
    Financial.photo = Financialbutton
    Financial.place(x=327,y=360,width=200,height=100)
 
    Stockbutton=PhotoImage(file="StockButton.png")
 
    Stock = Button(Main,image = Stockbutton, command = lambda:[StockMenu(),Main.destroy()])
    Stock.configure(bg="#aeaaf0")
    Stock.photo = Stockbutton
    Stock.place(x=753,y=360,width=200,height=100)
 
    logomain=PhotoImage(file="PPSMainlogo.png")
 
    Logomain = Label(Main,image=logomain)
    Logomain.photo = logomain
    Logomain.config(bg="#aedaf0")
    Logomain.place(x=405,y=150)
 
    logoside=PhotoImage(file="Logocorner.png")
 
    Logoside = Label(Main,image=logoside)
    Logoside.photo= logoside
    Logoside.config(bg="#aedaf0")
    Logoside.place(x=1230,y=0)
 
 
 
    return Main
#========================================================================================================================================
#========================================================================================================================================
 
#========================================================================================================================================
#========================================================================================================================================
 
def makeFinancial():
 
    Financial = Toplevel()
    Financial.geometry("1280x720")
    Financial.config(bg="#aedaf0")
 
 
 
    Logomain = Button(Financial,image=logomain, command = lambda: [makeMain(),Financial.destroy()])
    Logomain.photo = logomain
    Logomain.config(bg="#aedaf0")
    Logomain.place(x=405,y=100, width = 426, height = 128)
 
 
 
    Logoside = Label(Financial,image=logoside)
    Logoside.photo= logoside
    Logoside.config(bg="#aedaf0")
    Logoside.place(x=1230,y=0)
 
    customerEdit=PhotoImage(file="CustomerEDIT.png")
 
    CustomerEdit = Button(Financial,image=customerEdit, command = lambda: [MakeCustomeEdit(),Financial.destroy()])
    CustomerEdit.photo = customerEdit
    CustomerEdit.config(bg="#aedaf0")
    CustomerEdit.place(x=28, y= 300, width = 200, height = 100)
 
    supplierEdit=PhotoImage(file="SupplierEdit.png")
 
    SupplierEdit = Button(Financial,image=supplierEdit, command = lambda: [MakeSuppEdit(),Financial.destroy()])
    SupplierEdit.photo = supplierEdit
    SupplierEdit.config(bg="#aedaf0")
    SupplierEdit.place(x=284, y= 300, width = 200, height = 100)
 
    invoiceEdit=PhotoImage(file="InvoiceEdit.png")
 
    InvoiceEdit = Button(Financial,image=invoiceEdit, command = lambda: [MakeInvEdit(),Financial.destroy()])
    InvoiceEdit.photo = invoiceEdit
    InvoiceEdit.config(bg="#aedaf0")
    InvoiceEdit.place(x=540, y= 300, width = 200, height = 100)
 
    purchaseEdit=PhotoImage(file="PurchaseEdit.png")
 
    PurchaseEdit = Button(Financial,image=purchaseEdit, command = lambda: [MakePurEdit(),Financial.destroy()])
    PurchaseEdit.photo = purchaseEdit
    PurchaseEdit.config(bg="#aedaf0")
    PurchaseEdit.place(x=796, y= 300, width = 200, height = 100)
 
    transactionEdit=PhotoImage(file="TransactionEdit.png")
 
    TransactionEdit = Button(Financial,image = transactionEdit, command = lambda:[MakeTranEdit(),Financial.destroy()])
    TransactionEdit.photo = transactionEdit
    TransactionEdit.config(bg="#aedaf0")
    TransactionEdit.place(x=1052, y= 300, width = 200, height = 100)
#====================================================================
    customerSearch = PhotoImage(file="CustomerSearch.png")
 
    CustomerSearch = Button(Financial,image=customerSearch, command = lambda: [MakeCustSearch(), Financial.destroy()])
    CustomerSearch.photo = customerSearch
    CustomerSearch.config(bg="#aedaf0")
    CustomerSearch.place(x=28, y= 450, width = 200, height = 100)
 
    supplierSearch = PhotoImage(file="SupplierSearch.png")
 
    SupplierSearch = Button(Financial,image=supplierSearch, command = lambda: [MakeSuppSearch(),Financial.destroy()])
    SupplierSearch.photo=supplierSearch
    SupplierSearch.config(bg="#aedaf0")
    SupplierSearch.place(x=284, y= 450, width = 200, height = 100)
 
    invoiceSearch = PhotoImage(file="InvoiceSearch.png")
 
    InvoiceSearch = Button(Financial,image =invoiceSearch, command = lambda: [MakeInvSearch(), Financial.destroy()])
    InvoiceSearch.photo = invoiceSearch
    InvoiceSearch.config(bg="#aedaf0")
    InvoiceSearch.place(x=540, y= 450, width = 200, height = 100)
 
    purchaseSearch = PhotoImage(file="PurchaseSearch.png")
 
    PurchaseSearch = Button(Financial,image=purchaseSearch, command = lambda: [MakePurSearch(), Financial.destroy()])
    PurchaseSearch.photo=purchaseSearch
    PurchaseSearch.config(bg="#aedaf0")
    PurchaseSearch.place(x=796, y= 450, width = 200, height = 100)
 
    transactionSearch = PhotoImage(file="TransactionSearch.png")
 
    TransactionSearch = Button(Financial,image = transactionSearch, command = lambda: [MakeTranSearch(), Financial.destroy()])
    TransactionSearch.photo=transactionSearch
    TransactionSearch.config(bg="#aedaf0")
    TransactionSearch.place(x=1052, y= 450, width = 200, height = 100)
 
#====================================================================
    return Financial
 
#========================================================================================================================================
#========================================================================================================================================
 
#========================================================================================================================================
#========================================================================================================================================
 
def MakeCustomeEdit():
 
    global IDEnter_Var , TitleEnter_Var, ForeNameEnter_Var, SurNameEnter_Var,DOBEnter_Var, AddressEnter_Var, PostCodeEnter_Var, CityEnter_Var, TelephoneEnter_Var, EmailEnter_Var, CustEdBox
 
    CustEdit = Toplevel()
    CustEdit.geometry("1280x720")
    CustEdit.config(bg="#aedaf0")
 
    Logoside = Label(CustEdit,image=logoside)
    Logoside.photo= logoside
    Logoside.config(bg="#aedaf0")
    Logoside.place(x=1230,y=0)
 
    CustEdBox = Listbox(CustEdit)
    CustEdBox.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    CustEdBox.place(x=605,y=330,width=600,height=340)
 
    addCust = PhotoImage(file="AddCust.png")
 
    AddCust = Button(CustEdit, image=addCust, command = addnewClient)
    AddCust.photo = addCust
    AddCust.config(bg="#aedaf0")
    AddCust.place(x=630, y=230, width = 150, height = 75)
 
    amendCust = PhotoImage(file="AmendCust.png")
 
    AmendCust = Button(CustEdit, image=amendCust, command = UpdateCust)
    AmendCust.photo = amendCust
    AmendCust.config(bg="#aedaf0")
    AmendCust.place(x=830, y=230, width = 150, height = 75)
 
    delCust = PhotoImage(file="DelCust.png")
 
    DelCust = Button(CustEdit, image=delCust, command = DelCustConfirm)
    DelCust.photo = delCust
    DelCust.config(bg="#aedaf0")
    DelCust.place(x=1030, y=230, width = 150, height = 75)
 
    Home = Button(CustEdit,image = home,command = lambda: [makeMain(),CustEdit.destroy()])
    Home.photo = home
    Home.config(bg="#aedaf0")
    Home.place(x=630,y=130,width=250,height=75)
 
    Return = Button(CustEdit,image = back,command = lambda: [makeFinancial(),CustEdit.destroy()])
    Return.photo = back
    Return.config(bg="#aedaf0")
    Return.place(x=930,y=130,width=250,height=75)
 
    ID = Label(CustEdit,image=Id)
    ID.photo= Id
    ID.config(bg="#aedaf0")
    ID.place(x=50,y=10)
 
    IDEnter_Var = StringVar()
 
    IDEnter = Entry(CustEdit,textvariable = IDEnter_Var)
    IDEnter.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    IDEnter.place(x=200,y=10,width=300,height=50)
 
    Title = Label(CustEdit,text="Title")
    Title.config(bg="white")
    Title.place(x=50,y=80,width = 100, height = 50)
 
    TitleEnter_Var = StringVar()
 
    TitleEnter = Entry(CustEdit)
    TitleEnter.configure(text=TitleEnter_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    TitleEnter.place(x=200,y=80,width=300,height=50)
 
    ForeName = Label(CustEdit,text="Forename")
    ForeName.config(bg="white")
    ForeName.place(x=50,y=150,width = 100, height = 50)
 
    ForeNameEnter_Var = StringVar()
 
    ForeNameEnter = Entry(CustEdit)
    ForeNameEnter.configure(text=ForeNameEnter_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    ForeNameEnter.place(x=200,y=150,width=300,height=50)
 
    SurName = Label(CustEdit,text="Surname")
    SurName.config(bg="white")
    SurName.place(x=50,y=220,width = 100, height = 50)
 
    SurNameEnter_Var = StringVar()
 
    SurNameEnter = Entry(CustEdit)
    SurNameEnter.configure(text=SurNameEnter_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    SurNameEnter.place(x=200,y=220,width=300,height=50)
 
    DOB = Label(CustEdit, text = "Date of Birth")
    DOB.config(bg="white")
    DOB.place(x=50,y=290,width =100, height = 50)
 
    DOBEnter_Var = StringVar()
 
    DOBEnter = Entry(CustEdit)
    DOBEnter.configure(text=DOBEnter_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    DOBEnter.place(x=200,y=290,width =300, height = 50)
 
    Address = Label(CustEdit,text="Address")
    Address.config(bg="white")
    Address.place(x=50,y=360,width = 100, height = 50)
 
    AddressEnter_Var = StringVar()
 
    AddressEnter = Entry(CustEdit)
    AddressEnter.configure(text=AddressEnter_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    AddressEnter.place(x=200,y=360,width=300,height=50)
 
    PostCode = Label(CustEdit,text="PostCode")
    PostCode.config(bg="white")
    PostCode.place(x=50,y=430,width = 100, height = 50)
 
    PostCodeEnter_Var = StringVar()
 
    PostCodeEnter = Entry(CustEdit)
    PostCodeEnter.configure(text=PostCodeEnter_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    PostCodeEnter.place(x=200,y=430,width=300,height=50)
 
    City = Label(CustEdit,text="City/Town")
    City.config(bg="white")
    City.place(x=50,y=500,width = 100, height = 50)
 
    CityEnter_Var = StringVar()
 
    CityEnter = Entry(CustEdit)
    CityEnter.configure(text=CityEnter_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    CityEnter.place(x=200,y=500,width=300,height=50)
 
    Telephone = Label(CustEdit,text="Telephone")
    Telephone.config(bg="white")
    Telephone.place(x=50,y=570,width = 100, height = 50)
 
    TelephoneEnter_Var = StringVar()
 
    TelephoneEnter = Entry(CustEdit)
    TelephoneEnter.configure(text=TelephoneEnter_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    TelephoneEnter.place(x=200,y=570,width=300,height=50)
 
    Email = Label(CustEdit,text="Email")
    Email.config(bg="white")
    Email.place(x=50,y=640,width = 100, height = 50)
 
    EmailEnter_Var = StringVar()
 
    EmailEnter = Entry(CustEdit)
    EmailEnter.configure(text=EmailEnter_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    EmailEnter.place(x=200,y=640,width=300,height=50)
 
    return CustEdit
 
#========================================================================================================================================
#========================================================================================================================================
def MakeCustSearch():
 
    global CustSearchBox, IDSearch_Var, CityEnter_Var, SurnameEnter_Var
 
    CustSearch = Toplevel()
    CustSearch.geometry("1280x720")
    CustSearch.config(bg="#aedaf0")
 
    Logoside = Label(CustSearch,image=logoside)
    Logoside.photo= logoside
    Logoside.config(bg="#aedaf0")
    Logoside.place(x=1230,y=0)
 
    Logomain = Label(CustSearch,image=logomain)
    Logomain.photo = logomain
    Logomain.config(bg="#aedaf0")
    Logomain.place(x=20,y=250)
 
    CustSearchBox = Listbox(CustSearch)
    CustSearchBox.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    CustSearchBox.place(x=460,y=100,width=800,height=600)
 
    Home = Button(CustSearch,image = home,command = lambda: [makeMain(),CustSearch.destroy()])
    Home.photo = home
    Home.config(bg="#aedaf0")
    Home.place(x=550,y=12,width=250,height=75)
 
    Return = Button(CustSearch,image = back,command = lambda: [makeFinancial(),CustSearch.destroy()])
    Return.photo = back
    Return.config(bg="#aedaf0")
    Return.place(x=850,y=12,width=250,height=75)
 
    CustSearchCity = Button(CustSearch, text = "Search Customer via City", command = lambda: [ResetCustSearchBox(),SearchClientCity()])
    CustSearchCity.configure(font=("Microsoft Sans Serif","8","normal"),bg="white")
    CustSearchCity.place(x=80,y=520,width=300,height=60)
 
    CustSearchSur = Button(CustSearch, text = "Search Customer via Surname", command = lambda: [ResetCustSearchBox(),SearchClientSurname()])
    CustSearchSur.configure(font=("Microsoft Sans Serif","8","normal"),bg="white")
    CustSearchSur.place(x=80,y=600,width=300,height=60)
 
    CustSearchID = Button(CustSearch, text = "Search Customer Via ID", command = lambda: [ResetCustSearchBox(),SearchClientID()])
    CustSearchID.configure(font=("Microsoft Sans Serif","8","normal"),bg="white")
    CustSearchID.place(x=80,y=440,width=300,height=60)
 
    ID = Label(CustSearch,image=Id)
    ID.photo= Id
    ID.config(bg="#aedaf0")
    ID.place(x=50,y=30)
 
    IDSearch_Var = StringVar()
 
    IDEnter = Entry(CustSearch,textvariable = IDSearch_Var)
    IDEnter.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    IDEnter.place(x=170,y=30,width=250,height=50)
 
    City = Label(CustSearch,text="City/Town")
    City.config(bg="white")
    City.place(x=50, y=100, width = 100, height =50)
 
    CityEnter_Var = StringVar()
 
    CityEnter = Entry(CustSearch,textvariable = CityEnter_Var)
    CityEnter.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    CityEnter.place(x=170,y=100,width=250,height=50)
 
    Surname = Label(CustSearch, text = "Surname")
    Surname.config(bg="white")
    Surname.place(x=50, y=170, width = 100, height =50)
 
    SurnameEnter_Var = StringVar()
 
    SurnameEnter = Entry(CustSearch,textvariable = SurnameEnter_Var)
    SurnameEnter.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    SurnameEnter.place(x=170,y=170,width=250,height=50)
 
#========================================================================================================================================
#========================================================================================================================================
 
def MakeSuppEdit():
 
    global SupID_Var, SupAddress_Var, SupPostcode_Var, SupCity_Var, SupTitle_Var, SupName_Var, SupTelephone_Var, SupEmail_Var, SupEditBox, SupConName_Var
 
    SupEdit = Toplevel()
    SupEdit.geometry("1280x720")
    SupEdit.config(bg="#aedaf0")
 
    Logoside = Label(SupEdit,image=logoside)
    Logoside.photo= logoside
    Logoside.config(bg="#aedaf0")
    Logoside.place(x=1230,y=0)
 
    SupEditBox = Listbox(SupEdit)
    SupEditBox.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    SupEditBox.place(x=605,y=330,width=600,height=340)
 
    ##add supp button
 
    AddSup = Button(SupEdit, text = "Addsup", command = AddSupp)#image=addSup)
    #AddSup.photo = addSup
    AddSup.config(bg="#aedaf0")
    AddSup.place(x=630, y=230, width = 150, height = 75)
 
    ##amendSup = PhotoImage(file="AmendCust.png")
 
    AmendSup = Button(SupEdit,text = "AMEND SUP", command = UpdateSupp) #image=amendCust)
    #AmendSup.photo = amendCust
    AmendSup.config(bg="#aedaf0")
    AmendSup.place(x=830, y=230, width = 150, height = 75)
 
    ##delCust = PhotoImage(file="DelCust.png")
 
    DelSup = Button(SupEdit, text = "DelSup", command = DelSuppConfirm)#image=delCust)
    #DelSup.photo = delCust
    DelSup.config(bg="#aedaf0")
    DelSup.place(x=1030, y=230, width = 150, height = 75)
 
    Home = Button(SupEdit,image = home,command = lambda: [makeMain(),SupEdit.destroy()])
    Home.photo = home
    Home.config(bg="#aedaf0")
    Home.place(x=630,y=130,width=250,height=75)
 
    Return = Button(SupEdit,image = back,command = lambda: [makeFinancial(),SupEdit.destroy()])
    Return.photo = back
    Return.config(bg="#aedaf0")
    Return.place(x=930,y=130,width=250,height=75)
 
 
 
    ID = Label(SupEdit,text="ID")
    ID.config(bg="white")
    ID.place(x=50,y=60,width = 100, height = 50)
 
    SupID_Var = StringVar()
 
    SupID = Entry(SupEdit)
    SupID.configure(text=SupID_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    SupID.place(x=200,y=60,width=300,height=50)
 
    Supname = Label(SupEdit, text="Name")
    Supname.config(bg="white")
    Supname.place(x=50,y=130,width=100,height=50)
     
    SupName_Var = StringVar()
     
    SupName = Entry(SupEdit)
    SupName.config(text=SupName_Var, font = ("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    SupName.place(x=200, y=130, width = 300, height=50)
 
    SupAddress = Label(SupEdit,text="Address")
    SupAddress.config(bg="white")
    SupAddress.place(x=50,y=200,width = 100, height = 50)
 
    SupAddress_Var = StringVar()
 
    SupAddress = Entry(SupEdit)
    SupAddress.configure(text=SupAddress_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    SupAddress.place(x=200,y=200,width=300,height=50)
 
    SupPostcode = Label(SupEdit,text="Postcode")
    SupPostcode.config(bg="white")
    SupPostcode.place(x=50,y=270,width = 100, height = 50)
 
    SupPostcode_Var = StringVar()
 
    SupPostcode = Entry(SupEdit)
    SupPostcode.configure(text=SupPostcode_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    SupPostcode.place(x=200,y=270,width=300,height=50)
 
    SupCity = Label(SupEdit,text="City/Town")
    SupCity.config(bg="white")
    SupCity.place(x=50,y=340,width = 100, height = 50)
 
    SupCity_Var = StringVar()
 
    SupCity = Entry(SupEdit)
    SupCity.configure(text=SupCity_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    SupCity.place(x=200,y=340,width=300,height=50)
 
    SupTitle = Label(SupEdit,text="Contact Title")
    SupTitle.config(bg="white")
    SupTitle.place(x=50,y=410,width = 100, height = 50)
 
    SupTitle_Var = StringVar()
 
    SupTitle = Entry(SupEdit)
    SupTitle.configure(text=SupTitle_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    SupTitle.place(x=200,y=410,width=300,height=50)
 
    SupName = Label(SupEdit,text="Contact Name")
    SupName.config(bg="white")
    SupName.place(x=50,y=480,width = 100, height = 50)
 
    SupConName_Var = StringVar()
 
    SupName = Entry(SupEdit)
    SupName.configure(text=SupConName_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    SupName.place(x=200,y=480,width=300,height=50)
 
    SupTelephone = Label(SupEdit,text="Contact Telephone")
    SupTelephone.config(bg="white")
    SupTelephone.place(x=50,y=550,width = 100, height = 50)
 
    SupTelephone_Var = StringVar()
 
    SupTelephone = Entry(SupEdit)
    SupTelephone.configure(text=SupTelephone_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    SupTelephone.place(x=200,y=550,width=300,height=50)
 
    SupEmail = Label(SupEdit,text="Contact Email")
    SupEmail.config(bg="white")
    SupEmail.place(x=50,y=620,width = 100, height = 50)
 
    SupEmail_Var = StringVar()
 
    SupEmail = Entry(SupEdit)
    SupEmail.configure(text=SupEmail_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    SupEmail.place(x=200,y=620,width=300,height=50)
 
    return SupEdit
 
#========================================================================================================================================
#========================================================================================================================================
def MakeSuppSearch():
 
    global SuppSearchBox, IDSearchSupp_Var, CitySearchSupp_Var, NameSearchSupp_Var
 
    SuppSearch = Toplevel()
    SuppSearch.geometry("1280x720")
    SuppSearch.config(bg="#aedaf0")
 
    Logoside = Label(SuppSearch,image=logoside)
    Logoside.photo= logoside
    Logoside.config(bg="#aedaf0")
    Logoside.place(x=1230,y=0)
 
    Logomain = Label(SuppSearch,image=logomain)
    Logomain.photo = logomain
    Logomain.config(bg="#aedaf0")
    Logomain.place(x=20,y=250)
 
    SuppSearchBox = Listbox(SuppSearch)
    SuppSearchBox.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    SuppSearchBox.place(x=460,y=100,width=800,height=600)
 
    Home = Button(SuppSearch,image = home,command = lambda: [makeMain(),SuppSearch.destroy()])
    Home.photo = home
    Home.config(bg="#aedaf0")
    Home.place(x=550,y=12,width=250,height=75)
 
    Return = Button(SuppSearch,image = back,command = lambda: [makeFinancial(),SuppSearch.destroy()])
    Return.photo = back
    Return.config(bg="#aedaf0")
    Return.place(x=850,y=12,width=250,height=75)
 
    SuppSearchCity = Button(SuppSearch, text = "Search Customer via City", command = lambda: [ResetSuppSearchBox(),SearchSupplierCity()])
    SuppSearchCity.configure(font=("Microsoft Sans Serif","8","normal"),bg="white")
    SuppSearchCity.place(x=80,y=520,width=300,height=60)
 
    SuppSearchName = Button(SuppSearch, text = "Search Customer via Surname", command = lambda: [ResetSuppSearchBox(),SearcSupliername()])
    SuppSearchName.configure(font=("Microsoft Sans Serif","8","normal"),bg="white")
    SuppSearchName.place(x=80,y=600,width=300,height=60)
 
    SuppSearchID = Button(SuppSearch, text = "Search Customer Via ID", command = lambda: [ResetSuppSearchBox(),SearchSupplierID()])
    SuppSearchID.configure(font=("Microsoft Sans Serif","8","normal"),bg="white")
    SuppSearchID.place(x=80,y=440,width=300,height=60)
 
    ID = Label(SuppSearch,image=Id)
    ID.photo= Id
    ID.config(bg="#aedaf0")
    ID.place(x=50,y=30)
 
    IDSearchSupp_Var = StringVar()
 
    IDEnter = Entry(SuppSearch,textvariable = IDSearchSupp_Var)
    IDEnter.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    IDEnter.place(x=170,y=30,width=250,height=50)
 
    City = Label(SuppSearch,text="City/Town")
    City.config(bg="white")
    City.place(x=50, y=100, width = 100, height =50)
 
    CitySearchSupp_Var = StringVar()
 
    CityEnter = Entry(SuppSearch,textvariable = CitySearchSupp_Var)
    CityEnter.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    CityEnter.place(x=170,y=100,width=250,height=50)
 
    Name = Label(SuppSearch, text = "Surname")
    Name.config(bg="white")
    Name.place(x=50, y=170, width = 100, height =50)
 
    NameSearchSupp_Var = StringVar()
 
    NameEnter = Entry(SuppSearch,textvariable = NameSearchSupp_Var)
    NameEnter.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    NameEnter.place(x=170,y=170,width=250,height=50)
 
#========================================================================================================================================
#========================================================================================================================================
 
def MakeInvEdit():
     
    global InvEdBox,InvID_Var, InvCustID_Var, InvAddress_Var, InvDate_Var,InvDueDate_Var,InvSalesCode_Var,InvQuantity_Var,InvDescription_Var,InvRate_Var, InvTotBox
 
    InvEdit = Toplevel()
    InvEdit.geometry("1280x720")
    InvEdit.config(bg="#aedaf0")
 
    Logoside = Label(InvEdit,image=logoside)
    Logoside.photo= logoside
    Logoside.config(bg="#aedaf0")
    Logoside.place(x=1230,y=0)
 
    InvEdBox = Listbox(InvEdit)
    InvEdBox.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    InvEdBox.place(x=605,y=330,width=600,height=340)
 
 
 
    AddInv = Button(InvEdit, text = "AddInv",command = Addinv)
    #AddInv.photo = addCust
    AddInv.config(bg="#aedaf0")
    AddInv.place(x=630, y=230, width = 150, height = 75)
 
 
 
    AmendInv = Button(InvEdit,text = "AmendInv", command = UpdateInv)# image=amendCust)
    #AmendInv.photo = amendCust
    AmendInv.config(bg="#aedaf0")
    AmendInv.place(x=830, y=230, width = 150, height = 75)
 
 
 
    DelInv = Button(InvEdit, text = "DelINv", command =DelInvConfirm)#image=delCust)
    #DelInv.photo = delCust
    DelInv.config(bg="#aedaf0")
    DelInv.place(x=1030, y=230, width = 150, height = 75)
 
    Home = Button(InvEdit,image = home,command = lambda: [makeMain(),InvEdit.destroy()])
    Home.photo = home
    Home.config(bg="#aedaf0")
    Home.place(x=630,y=130,width=250,height=75)
 
    Return = Button(InvEdit,image = back,command = lambda: [makeFinancial(),InvEdit.destroy()])
    Return.photo = back
    Return.config(bg="#aedaf0")
    Return.place(x=930,y=130,width=250,height=75)
 
    ID = Label(InvEdit,image=Id)
    ID.photo= Id
    ID.config(bg="#aedaf0")
    ID.place(x=50,y=60)
 
    InvID_Var = StringVar()
 
    InvID = Entry(InvEdit)
    InvID.configure(text=InvID_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    InvID.place(x=200,y=60,width=300,height=50)
 
    InvCustID = Label(InvEdit,text="custId")
    InvCustID.config(bg="white")
    InvCustID.place(x=50,y=120,width = 100, height = 50)
 
    InvCustID_Var = StringVar()
 
    InvCustID = Entry(InvEdit)
    InvCustID.configure(text=InvCustID_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    InvCustID.place(x=200,y=120,width=300,height=50)
 
    InvAddress = Label(InvEdit,text="Address of job")
    InvAddress.config(bg="white")
    InvAddress.place(x=50,y=180,width = 100, height = 50)
 
    InvAddress_Var = StringVar()
 
    InvCustID = Entry(InvEdit)
    InvCustID.configure(text=InvAddress_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    InvCustID.place(x=200,y=180,width=300,height=50)
 
    InvDate = Label(InvEdit,text="Date")
    InvDate.config(bg="white")
    InvDate.place(x=50,y=240,width = 100, height = 50)
 
    InvDate_Var = StringVar()
 
    InvDate = Entry(InvEdit)
    InvDate.configure(text=InvDate_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    InvDate.place(x=200,y=240,width=300,height=50)
 
    InvDueDate = Label(InvEdit,text="DueDate")
    InvDueDate.config(bg="white")
    InvDueDate.place(x=50,y=300,width = 100, height = 50)
 
    InvDueDate_Var = StringVar()
 
    InvDueDate = Entry(InvEdit)
    InvDueDate.configure(text=InvDueDate_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    InvDueDate.place(x=200,y=300,width=300,height=50)
 
    InvSalesCode = Label(InvEdit,text="Sales Cods")
    InvSalesCode.config(bg="white")
    InvSalesCode.place(x=50,y=360,width = 100, height = 50)
 
    InvSalesCode_Var = StringVar()
 
    InvSalesCode = Entry(InvEdit)
    InvSalesCode.configure(text=InvSalesCode_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    InvSalesCode.place(x=200,y=360,width=300,height=50)
 
    InvQuantity = Label(InvEdit,text="Quantity")
    InvQuantity.config(bg="white")
    InvQuantity.place(x=50,y=420,width = 100, height = 50)
 
    InvQuantity_Var = IntVar()
 
    InvQuantity = Entry(InvEdit)
    InvQuantity.configure(text=InvQuantity_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    InvQuantity.place(x=200,y=420,width=300,height=50)
 
    InvDescription = Label(InvEdit,text="Description")
    InvDescription.config(bg="white")
    InvDescription.place(x=50,y=480,width = 100, height = 50)
 
    InvDescription_Var = StringVar()
 
    InvDescription = Entry(InvEdit)
    InvDescription.configure(text=InvDescription_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    InvDescription.place(x=200,y=480,width=300,height=50)
 
    InvRate = Label(InvEdit,text="Rate")
    InvRate.config(bg="white")
    InvRate.place(x=50,y=540,width = 100, height = 50)
 
    InvRate_Var = IntVar()
 
    InvRate = Entry(InvEdit)
    InvRate.configure(text=InvRate_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    InvRate.place(x=200,y=540,width=300,height=50)
 
    InvTot = Label(InvEdit,text="Total Amount due")
    InvTot.config(bg="white")
    InvTot.place(x=50,y=600,width = 100, height = 50)
 
    InvTotBox = Listbox(InvEdit)
    InvTotBox.configure(font=("Microsoft Sans Serif","16","normal"),bg="#b1d2e2")
    InvTotBox.place(x=200,y=600,width=150,height=50)
 
    InvTotCalc = Button(InvEdit, text = "Calc Total", command = lambda: [ResetinvCalcBox(), CalcInvTot()])
    InvTotCalc.config(bg = "white")
    InvTotCalc.place(x=400, y=600, width = 100 ,height = 50)
 
    return InvEdit
def MakeInvSearch():
 
    global InvSearchBox, IDSearchInv_Var, CustIDSearchInv_Var, SalesCodeSearchInv_Var
 
    InvSearch = Toplevel()
    InvSearch.geometry("1280x720")
    InvSearch.config(bg="#aedaf0")
 
    Logoside = Label(InvSearch,image=logoside)
    Logoside.photo= logoside
    Logoside.config(bg="#aedaf0")
    Logoside.place(x=1230,y=0)
 
    Logomain = Label(InvSearch,image=logomain)
    Logomain.photo = logomain
    Logomain.config(bg="#aedaf0")
    Logomain.place(x=20,y=250)
 
    InvSearchBox = Listbox(InvSearch)
    InvSearchBox.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    InvSearchBox.place(x=460,y=100,width=800,height=600)
 
    Home = Button(InvSearch,image = home,command = lambda: [makeMain(),InvSearch.destroy()])
    Home.photo = home
    Home.config(bg="#aedaf0")
    Home.place(x=550,y=12,width=250,height=75)
 
    Return = Button(InvSearch,image = back,command = lambda: [makeFinancial(),InvSearch.destroy()])
    Return.photo = back
    Return.config(bg="#aedaf0")
    Return.place(x=850,y=12,width=250,height=75)
 
    InvSearchID = Button(InvSearch, text = "Search Invoice via Invoice ID", command = lambda: [ResetInvSearchBox(),SearchIDInv()])
    InvSearchID.configure(font=("Microsoft Sans Serif","8","normal"),bg="white")
    InvSearchID.place(x=80,y=440,width=300,height=60)
 
    InvSearchCustID = Button(InvSearch, text = "Search Invoice via Customer ID", command = lambda: [ResetInvSearchBox(),SearchCustIDInv()])
    InvSearchCustID.configure(font=("Microsoft Sans Serif","8","normal"),bg="white")
    InvSearchCustID.place(x=80,y=520,width=300,height=60)
 
    InvSearchSalescode = Button(InvSearch, text = "Search Invoice Via Sales Code", command = lambda: [ResetInvSearchBox(),SearchSCInv()])
    InvSearchSalescode.configure(font=("Microsoft Sans Serif","8","normal"),bg="white")
    InvSearchSalescode.place(x=80,y=600,width=300,height=60)
 
    ID = Label(InvSearch,image=Id)
    ID.photo= Id
    ID.config(bg="#aedaf0")
    ID.place(x=50,y=30)
 
    IDSearchInv_Var = StringVar()
 
    IDEnter = Entry(InvSearch,textvariable = IDSearchInv_Var)
    IDEnter.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    IDEnter.place(x=170,y=30,width=250,height=50)
 
    CustID = Label(InvSearch,text="CustID")
    CustID.config(bg="white")
    CustID.place(x=50, y=100, width = 100, height =50)
 
    CustIDSearchInv_Var = StringVar()
 
    CustIDEnter = Entry(InvSearch,textvariable = CustIDSearchInv_Var)
    CustIDEnter.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    CustIDEnter.place(x=170,y=100,width=250,height=50)
 
    SalesCode = Label(InvSearch, text = "SalesCode")
    SalesCode.config(bg="white")
    SalesCode.place(x=50, y=170, width = 100, height =50)
 
    SalesCodeSearchInv_Var = StringVar()
 
    SalesCodeEnter = Entry(InvSearch,textvariable = SalesCodeSearchInv_Var)
    SalesCodeEnter.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    SalesCodeEnter.place(x=170,y=170,width=250,height=50)
 
def MakePurEdit():
 
    global PurEditBox, PurID_Var, PurSupID_Var, PurCustID_Var, PurDate_Var, PurDueDate_Var, PurCode_Var, PurDescription_Var, PurTotal_Var
 
    PurEdit = Toplevel()
    PurEdit.geometry("1280x720")
    PurEdit.config(bg="#aedaf0")
 
    Logoside = Label(PurEdit,image=logoside)
    Logoside.photo= logoside
    Logoside.config(bg="#aedaf0")
    Logoside.place(x=1230,y=0)
 
    PurEditBox = Listbox(PurEdit)
    PurEditBox.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    PurEditBox.place(x=605,y=330,width=600,height=340)
 
    ##add supp button
 
    AddPurButton = Button(PurEdit, text = "Add Purchase", command = AddPur)#image=addSup)
    #AddPur.photo = addSup
    AddPurButton.config(bg="#aedaf0")
    AddPurButton.place(x=630, y=230, width = 150, height = 75)
 
    ##amendSup = PhotoImage(file="AmendCust.png")
 
    AmendPurButton = Button(PurEdit,text = "AMEND Purchase", command = UpdatePur) #image=amendCust)
    #AmendSup.photo = amendCust
    AmendPurButton.config(bg="#aedaf0")
    AmendPurButton.place(x=830, y=230, width = 150, height = 75)
 
    ##delCust = PhotoImage(file="DelCust.png")
 
    DelPurButton = Button(PurEdit, text = "Delete Purchase", command = DelPurConfirm)#image=delCust)
    #DelSup.photo = delCust
    DelPurButton.config(bg="#aedaf0")
    DelPurButton.place(x=1030, y=230, width = 150, height = 75)
 
    Home = Button(PurEdit,image = home,command = lambda: [makeMain(),PurEdit.destroy()])
    Home.photo = home
    Home.config(bg="#aedaf0")
    Home.place(x=630,y=60,width=250,height=75)
 
    Return = Button(PurEdit,image = back,command = lambda: [makeFinancial(),PurEdit.destroy()])
    Return.photo = back
    Return.config(bg="#aedaf0")
    Return.place(x=930,y=60,width=250,height=75)
 
 
 
    PurID = Label(PurEdit,text="PurID")
    PurID.config(bg="white")
    PurID.place(x=50,y=130,width = 100, height = 50)
 
    PurID_Var = StringVar()
 
    PurID = Entry(PurEdit)
    PurID.configure(text=PurID_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    PurID.place(x=200,y=130,width=300,height=50)
 
    PurSupID = Label(PurEdit,text="SupID")
    PurSupID.config(bg="white")
    PurSupID.place(x=50,y=200,width = 100, height = 50)
 
    PurSupID_Var = StringVar()
 
    PurSupID = Entry(PurEdit)
    PurSupID.configure(text=PurSupID_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    PurSupID.place(x=200,y=200,width=300,height=50)
 
    PurCustID = Label(PurEdit,text="CustID")
    PurCustID.config(bg="white")
    PurCustID.place(x=50,y=270,width = 100, height = 50)
 
    PurCustID_Var = StringVar()
 
    PurCustID = Entry(PurEdit)
    PurCustID.configure(text=PurCustID_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    PurCustID.place(x=200,y=270,width=300,height=50)
 
    PurDate = Label(PurEdit,text="Purchase Date")
    PurDate.config(bg="white")
    PurDate.place(x=50,y=340,width = 100, height = 50)
 
    PurDate_Var = StringVar()
 
    PurDate = Entry(PurEdit)
    PurDate.configure(text=PurDate_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    PurDate.place(x=200,y=340,width=300,height=50)
 
    PurDueDate = Label(PurEdit,text="Due Date")
    PurDueDate.config(bg="white")
    PurDueDate.place(x=50,y=410,width = 100, height = 50)
 
    PurDueDate_Var = StringVar()
 
    PurDueDate = Entry(PurEdit)
    PurDueDate.configure(text=PurDueDate_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    PurDueDate.place(x=200,y=410,width=300,height=50)
 
    PurCode = Label(PurEdit,text="Purchase Code")
    PurCode.config(bg="white")
    PurCode.place(x=50,y=480,width = 100, height = 50)
 
    PurCode_Var = StringVar()
 
    PurCode = Entry(PurEdit)
    PurCode.configure(text=PurCode_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    PurCode.place(x=200,y=480,width=300,height=50)
 
    PurDescription = Label(PurEdit,text="Description")
    PurDescription.config(bg="white")
    PurDescription.place(x=50,y=550,width = 100, height = 50)
 
    PurDescription_Var = StringVar()
 
    PurDescription = Entry(PurEdit)
    PurDescription.configure(text=PurDescription_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    PurDescription.place(x=200,y=550,width=300,height=50)
 
    PurTotal = Label(PurEdit,text="Total")
    PurTotal.config(bg="white")
    PurTotal.place(x=50,y=620,width = 100, height = 50)
 
    PurTotal_Var = StringVar()
 
    PurTotal = Entry(PurEdit)
    PurTotal.configure(text=PurTotal_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    PurTotal.place(x=200,y=620,width=300,height=50)
 
    return PurEdit
def MakePurSearch():
 
    global PurSearchBox, IDSearchPur_Var, CustIDSearchPur_Var, PurCodeSearchPur_Var
 
    PurSearch = Toplevel()
    PurSearch.geometry("1280x720")
    PurSearch.config(bg="#aedaf0")
 
    Logoside = Label(PurSearch,image=logoside)
    Logoside.photo= logoside
    Logoside.config(bg="#aedaf0")
    Logoside.place(x=1230,y=0)
 
    Logomain = Label(PurSearch,image=logomain)
    Logomain.photo = logomain
    Logomain.config(bg="#aedaf0")
    Logomain.place(x=20,y=250)
 
    PurSearchBox = Listbox(PurSearch)
    PurSearchBox.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    PurSearchBox.place(x=460,y=100,width=800,height=600)
 
    Home = Button(PurSearch,image = home,command = lambda: [makeMain(),PurSearch.destroy()])
    Home.photo = home
    Home.config(bg="#aedaf0")
    Home.place(x=550,y=12,width=250,height=75)
 
    Return = Button(PurSearch,image = back,command = lambda: [makeFinancial(),PurSearch.destroy()])
    Return.photo = back
    Return.config(bg="#aedaf0")
    Return.place(x=850,y=12,width=250,height=75)
 
    PurSearchID = Button(PurSearch, text = "Search Invoice via Purchase ID", command = lambda: [ResetPurCalcBox(),SearchIDPur()])
    PurSearchID.configure(font=("Microsoft Sans Serif","8","normal"),bg="white")
    PurSearchID.place(x=80,y=440,width=300,height=60)
 
    PurSearchCustID = Button(PurSearch, text = "Search Invoice via Customer ID", command = lambda: [ResetPurCalcBox(),SearchCustIDPur()])
    PurSearchCustID.configure(font=("Microsoft Sans Serif","8","normal"),bg="white")
    PurSearchCustID.place(x=80,y=520,width=300,height=60)
 
    PurSearchPurchasescode = Button(PurSearch, text = "Search Invoice Via Purchase Code", command = lambda: [ResetPurCalcBox(),SearchPCPur()])
    PurSearchPurchasescode.configure(font=("Microsoft Sans Serif","8","normal"),bg="white")
    PurSearchPurchasescode.place(x=80,y=600,width=300,height=60)
 
    ID = Label(PurSearch,image=Id)
    ID.photo= Id
    ID.config(bg="#aedaf0")
    ID.place(x=50,y=30)
 
    IDSearchPur_Var = StringVar()
 
    IDEnter = Entry(PurSearch,textvariable = IDSearchPur_Var)
    IDEnter.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    IDEnter.place(x=170,y=30,width=250,height=50)
 
    CustID = Label(PurSearch,text="CustID")
    CustID.config(bg="white")
    CustID.place(x=50, y=100, width = 100, height =50)
 
    CustIDSearchPur_Var = StringVar()
 
    CustIDEnter = Entry(PurSearch,textvariable = CustIDSearchPur_Var)
    CustIDEnter.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    CustIDEnter.place(x=170,y=100,width=250,height=50)
 
    PurchaseCode = Label(PurSearch, text = "PurchaseCode")
    PurchaseCode.config(bg="white")
    PurchaseCode.place(x=50, y=170, width = 100, height =50)
 
    PurCodeSearchPur_Var = StringVar()
 
    PurchaseCodeEnter = Entry(PurSearch,textvariable = PurCodeSearchPur_Var)
    PurchaseCodeEnter.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    PurchaseCodeEnter.place(x=170,y=170,width=250,height=50)
 
def MakeTranEdit():
 
    global TranEditBox, TranID_Var, TranInvID_Var, TranMade_Var, TranPurID_Var, TranSpent_Var, TranProfitBox
 
    TranEdit = Toplevel()
    TranEdit.geometry("1280x720")
    TranEdit.config(bg="#aedaf0")
 
    Logoside = Label(TranEdit,image=logoside)
    Logoside.photo= logoside
    Logoside.config(bg="#aedaf0")
    Logoside.place(x=1230,y=0)
 
    TranEditBox = Listbox(TranEdit)
    TranEditBox.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    TranEditBox.place(x=605,y=330,width=600,height=340)
 
    ##add supp button
 
    AddTran = Button(TranEdit, text = "Add Transaction", command = Addtransaction)#image=addSup)
    #AddTran.photo = addSup
    AddTran.config(bg="#aedaf0")
    AddTran.place(x=630, y=230, width = 250, height = 75)
 
 
    ##delCust = PhotoImage(file="DelCust.png")
 
    DelTran = Button(TranEdit, text = "Delete Transaction", command = DelTranConfirm)#image=delCust)
    #DelTran.photo = delCust
    DelTran.config(bg="#aedaf0")
    DelTran.place(x=930, y=230, width = 250, height = 75)
 
    Home = Button(TranEdit,image = home,command = lambda: [makeMain(),TranEdit.destroy()])
    Home.photo = home
    Home.config(bg="#aedaf0")
    Home.place(x=630,y=130,width=250,height=75)
 
    Return = Button(TranEdit,image = back,command = lambda: [makeFinancial(),TranEdit.destroy()])
    Return.photo = back
    Return.config(bg="#aedaf0")
    Return.place(x=930,y=130,width=250,height=75)
 
 
 
 
 
    TranID = Label(TranEdit,text="TranID")
    TranID.config(bg="white")
    TranID.place(x=50,y=270,width = 100, height = 50)
 
    TranID_Var = StringVar()
 
    TranIDEntry = Entry(TranEdit)
    TranIDEntry.configure(text=TranID_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    TranIDEntry.place(x=200,y=270,width=300,height=50)
 
    TranInvID = Label(TranEdit,text="Invoice ID")
    TranInvID.config(bg="white")
    TranInvID.place(x=50,y=340,width = 100, height = 50)
 
    TranInvID_Var = StringVar()
 
    TranInvIDEntry = Entry(TranEdit)
    TranInvIDEntry.configure(text=TranInvID_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    TranInvIDEntry.place(x=200,y=340,width=300,height=50)
 
    TranMade = Label(TranEdit,text="Made")
    TranMade.config(bg="white")
    TranMade.place(x=50,y=410,width = 100, height = 50)
 
    TranMade_Var = IntVar()
 
    TranMadeEntry = Entry(TranEdit)
    TranMadeEntry.configure(text=TranMade_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    TranMadeEntry.place(x=200,y=410,width=300,height=50)
 
    TranPurID = Label(TranEdit,text="Purchase ID")
    TranPurID.config(bg="white")
    TranPurID.place(x=50,y=480,width = 100, height = 50)
 
    TranPurID_Var = StringVar()
 
    TranPurIDEntry = Entry(TranEdit)
    TranPurIDEntry.configure(text=TranPurID_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    TranPurIDEntry.place(x=200,y=480,width=300,height=50)
 
    TranSpent = Label(TranEdit,text="Spent")
    TranSpent.config(bg="white")
    TranSpent.place(x=50,y=550,width = 100, height = 50)
 
    TranSpent_Var = IntVar()
 
    TranSpentEntry = Entry(TranEdit)
    TranSpentEntry.configure(text=TranSpent_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    TranSpentEntry.place(x=200,y=550,width=300,height=50)
 
    TranProfit = Label(TranEdit,text="Profit")
    TranProfit.config(bg="white")
    TranProfit.place(x=50,y=620,width = 100, height = 50)
 
    TranProfit_Var = StringVar()
 
    TranProfitBox = Listbox(TranEdit)
    TranProfitBox.configure(font=("Microsoft Sans Serif","16","normal"),bg="#b1d2e2")
    TranProfitBox.place(x=200,y=620,width=150,height=50)
 
    TranProfCalc = Button(TranEdit, text = "Calculate Profit", command = lambda: [ResetTranCalcBox(), CalcProfit()])
    TranProfCalc.config(bg = "white")
    TranProfCalc.place(x=400, y=620, width = 100 ,height = 50)
 
 
 
    return TranEdit
def MakeTranSearch():
 
    global TranSearchBox, IDSearchTran_Var, InvoiceIDSearchTran_Var, PurchaseIDEnterSearchTran_Var
 
    TranSearch = Toplevel()
    TranSearch.geometry("1280x720")
    TranSearch.config(bg="#aedaf0")
 
    Logoside = Label(TranSearch,image=logoside)
    Logoside.photo= logoside
    Logoside.config(bg="#aedaf0")
    Logoside.place(x=1230,y=0)
 
    Logomain = Label(TranSearch,image=logomain)
    Logomain.photo = logomain
    Logomain.config(bg="#aedaf0")
    Logomain.place(x=20,y=250)
 
    TranSearchBox = Listbox(TranSearch)
    TranSearchBox.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    TranSearchBox.place(x=460,y=100,width=800,height=600)
 
    Home = Button(TranSearch,image = home,command = lambda: [makeMain(),TranSearch.destroy()])
    Home.photo = home
    Home.config(bg="#aedaf0")
    Home.place(x=550,y=12,width=250,height=75)
 
    Return = Button(TranSearch,image = back,command = lambda: [makeFinancial(),TranSearch.destroy()])
    Return.photo = back
    Return.config(bg="#aedaf0")
    Return.place(x=850,y=12,width=250,height=75)
 
    TranSearchID = Button(TranSearch, text = "Search Transaction via Invoice ID", command = lambda: [ResetTranSearchbox(),SearchIDTran()])
    TranSearchID.configure(font=("Microsoft Sans Serif","8","normal"),bg="white")
    TranSearchID.place(x=80,y=440,width=300,height=60)
 
    TranSearchInvoiceID = Button(TranSearch, text = "Search Transaction via Invoice ID", command = lambda: [ResetTranSearchbox(),SearchInvoiceIDTran()])
    TranSearchInvoiceID.configure(font=("Microsoft Sans Serif","8","normal"),bg="white")
    TranSearchInvoiceID.place(x=80,y=520,width=300,height=60)
 
    TranSearchPurchaseCode = Button(TranSearch, text = "Search Transaction Via Purchase ID", command = lambda: [ResetTranSearchbox(),SearchPurchaseIDTran()])
    TranSearchPurchaseCode.configure(font=("Microsoft Sans Serif","8","normal"),bg="white")
    TranSearchPurchaseCode.place(x=80,y=600,width=300,height=60)
 
    ID = Label(TranSearch,image=Id)
    ID.photo= Id
    ID.config(bg="#aedaf0")
    ID.place(x=50,y=30)
 
    IDSearchTran_Var = StringVar()
 
    IDEnter = Entry(TranSearch,textvariable = IDSearchTran_Var)
    IDEnter.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    IDEnter.place(x=170,y=30,width=250,height=50)
 
    InvoiceID = Label(TranSearch,text="Invoice ID")
    InvoiceID.config(bg="white")
    InvoiceID.place(x=50, y=100, width = 100, height =50)
 
    InvoiceIDSearchTran_Var = StringVar()
 
    InvoiceIDEnter = Entry(TranSearch,textvariable = InvoiceIDSearchTran_Var)
    InvoiceIDEnter.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    InvoiceIDEnter.place(x=170,y=100,width=250,height=50)
 
    PurchaseID = Label(TranSearch, text = "Purchase ID")
    PurchaseID.config(bg="white")
    PurchaseID.place(x=50, y=170, width = 100, height =50)
 
    PurchaseIDEnterSearchTran_Var = StringVar()
 
    PurchaseIDEnter = Entry(TranSearch,textvariable = PurchaseIDEnterSearchTran_Var)
    PurchaseIDEnter.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    PurchaseIDEnter.place(x=170,y=170,width=250,height=50)
 
def StockMenu():
     
    Stock = Toplevel()
    Stock.geometry("1280x720")
    Stock.config(bg="#aedaf0")
     
    Logomain = Button(Stock,image=logomain, command = lambda: [makeMain(),Stock.destroy()])
    Logomain.photo = logomain
    Logomain.config(bg="#aedaf0")
    Logomain.place(x=405,y=100, width = 426, height = 128)
 
 
 
    Logoside = Label(Stock,image=logoside)
    Logoside.photo= logoside
    Logoside.config(bg="#aedaf0")
    Logoside.place(x=1230,y=0)
     
    StockEdit = Button(Stock,text = "Stock Edit", command = lambda: [StockEditForm(), Stock.destroy()])
    StockEdit.config(bg="#aedaf0")
    StockEdit.place(x=200,y=300,width=250,height=75)
     
    StockSearch = Button(Stock,text = "Stock Search", command = lambda : [StockSearchForm(), Stock.destroy()])
    StockSearch.config(bg="#aedaf0")
    StockSearch.place(x=200,y=500,width=250,height=75)
     
    StockTransfer = Button(Stock,text = "Stock Transfer", command = lambda: [StockTransferForm(), Stock.destroy()])
    StockTransfer.config(bg="#aedaf0")
    StockTransfer.place(x=830,y=300,width=250,height=75)
     
    PartsUsed = Button(Stock,text = "Parts Used",command = lambda: [UsedpartsSearchForm(), Stock.destroy()])
    PartsUsed.config(bg="#aedaf0")
    PartsUsed.place(x=830,y=500,width=250,height=75)
     
def StockEditForm ():
     
    global StockEditBox, StockID_Var, StockName_Var, StockPPU_Var, PadBox, StockCalc
     
     
    StockEdit = Toplevel()
    StockEdit.geometry("1280x720")
    StockEdit.config(bg="#aedaf0")
     
    Logoside = Label(StockEdit,image=logoside)
    Logoside.photo= logoside
    Logoside.config(bg="#aedaf0")
    Logoside.place(x=1230,y=0)
     
    StockEditBox = Listbox(StockEdit)
    StockEditBox.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    StockEditBox.place(x=605,y=330,width=600,height=340)
 
    AddStock = Button(StockEdit, text="Add Stock", command = AddStockItem)
    AddStock.config(bg="#aedaf0")
    AddStock.place(x=630, y=230, width = 150, height = 75)
 
    UpdateStock = Button(StockEdit, text="Update Stock Price per unit", command = UpdateStockPPU)
    UpdateStock.config(bg="#aedaf0")
    UpdateStock.place(x=830, y=230, width = 150, height = 75)
 
    DeleteStock = Button(StockEdit, text="Delete Stock", command = DelStockConfirm)
    DeleteStock.config(bg="#aedaf0")
    DeleteStock.place(x=1030, y=230, width = 150, height = 75)
 
    Home = Button(StockEdit,image = home,command = lambda: [makeMain(),StockEdit.destroy()])
    Home.photo = home
    Home.config(bg="#aedaf0")
    Home.place(x=630,y=140,width=250,height=75)
 
    Return = Button(StockEdit,image = back,command = lambda: [StockMenu(),StockEdit.destroy()])
    Return.photo = back
    Return.config(bg="#aedaf0")
    Return.place(x=930,y=140,width=250,height=75)
     
    StockID = Label(StockEdit,text="StockID")
    StockID.config(bg="white")
    StockID.place(x=50,y=130,width = 100, height = 50)
 
    StockID_Var = StringVar()
 
    StockIDEntry = Entry(StockEdit)
    StockIDEntry.configure(text=StockID_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    StockIDEntry.place(x=200,y=130,width=300,height=50)
     
    StockName = Label(StockEdit,text="StockName")
    StockName.config(bg="white")
    StockName.place(x=50,y=200,width = 100, height = 50)
 
    StockName_Var = StringVar()
 
    StockNameEntry = Entry(StockEdit)
    StockNameEntry.configure(text=StockName_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    StockNameEntry.place(x=200,y=200,width=300,height=50)
     
    StockPPU = Label(StockEdit,text="Stock Price Per unit")
    StockPPU.config(bg="white")
    StockPPU.place(x=50,y=270,width = 100, height = 50)
 
    StockPPU_Var = StringVar()
 
    StockPPUEntry = Entry(StockEdit)
    StockPPUEntry.configure(text=StockPPU_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    StockPPUEntry.place(x=200,y=270,width=300,height=50)
     
    One = Button(StockEdit, text = "1", command=lambda: One(PadBox))
    One.config(bg="white")
    One.place(x=50,y=410,width=50,height=50)
     
    Two = Button(StockEdit, text = "2", command = lambda: Two(PadBox))
    Two.config(bg="white")
    Two.place(x=120,y=410,width=50,height=50)
     
    Three = Button(StockEdit, text = "3", command = lambda: Three(PadBox))
    Three.config(bg="white")
    Three.place(x=190,y=410,width=50,height=50)
     
    Four = Button(StockEdit, text = "4", command = lambda: Four(PadBox))
    Four.config(bg="white")
    Four.place(x=50,y=470,width=50,height=50)
     
    Five = Button(StockEdit, text = "5", command = lambda: Five(PadBox))
    Five.config(bg="white")
    Five.place(x=120,y=470,width=50,height=50)
     
    Six = Button(StockEdit, text = "6", command = lambda: Six(PadBox))
    Six.config(bg="white")
    Six.place(x=190,y=470,width=50,height=50)
     
    Seven = Button(StockEdit, text = "7", command = lambda: Seven(PadBox))
    Seven.config(bg="white")
    Seven.place(x=50,y=530,width=50,height=50)
     
    Eight = Button(StockEdit, text = "8", command = lambda: Eight(PadBox))
    Eight.config(bg="white")
    Eight.place(x=120,y=530,width=50,height=50)
     
    Nine = Button(StockEdit, text = "9", command = lambda: Nine(PadBox))
    Nine.config(bg="white")
    Nine.place(x=190,y=530,width=50,height=50)
     
    Zero = Button(StockEdit, text = "0", command = lambda: Zero(PadBox))
    Zero.config(bg="white")
    Zero.place(x=120,y=590,width=50,height=50)
     
    Plus = Button(StockEdit, text = "+", command = lambda: AddtoStockItem(StockID_Var.get()))
    Plus.config(bg="white")
    Plus.place(x=190,y=590,width=50,height=50)
     
    Minus = Button(StockEdit, text = "-", command = lambda: TakefromStockItem(StockID_Var.get()))
    Minus.config(bg="white")
    Minus.place(x=50,y=590,width=50,height=50)
     
    Reset = Button(StockEdit, text = "Reset", command = lambda: Clear(PadBox))
    Reset.config(bg="white")
    Reset.place(x=310,y=470,width=100,height=50)
     
    PadBox = Entry(StockEdit)
    PadBox.configure(font=("Microsoft Sans Serif","16","normal"),bg="#b1d2e2")
    PadBox.place(x=260,y=410,width=200,height=50)
 

     
    def One(PadBox):
        PadBox.insert(END, "1")
    def Two(PadBox):
        PadBox.insert(END, "2")   
    def Three(PadBox):
        PadBox.insert(END, "3")
    def Four(PadBox):
        PadBox.insert(END, "4")
    def Five(PadBox):
        PadBox.insert(END, "5")
    def Six(PadBox):
        PadBox.insert(END, "6")
    def Seven(PadBox):
        PadBox.insert(END, "7")
    def Eight(PadBox):
        PadBox.insert(END, "8")
    def Nine(PadBox):
        PadBox.insert(END, "9")
    def Zero(PadBox):
        PadBox.insert(END, "0")
    def Clear(PadBox):
        PadBox.delete(0, END) 
def StockSearchForm():
     
    global StockSearchBox, StockIDEnter_Var, StockNameEnter_Var
     
    StockSearch = Toplevel()
    StockSearch.geometry("1280x720")
    StockSearch.config(bg="#aedaf0")
 
    Logoside = Label(StockSearch,image=logoside)
    Logoside.photo= logoside
    Logoside.config(bg="#aedaf0")
    Logoside.place(x=1230,y=0)
 
    Logomain = Label(StockSearch,image=logomain)
    Logomain.photo = logomain
    Logomain.config(bg="#aedaf0")
    Logomain.place(x=20,y=250)
 
    StockSearchBox = Listbox(StockSearch)
    StockSearchBox.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    StockSearchBox.place(x=460,y=100,width=800,height=600)
 
    Home = Button(StockSearch,image = home,command = lambda: [makeMain(),StockSearch.destroy()])
    Home.photo = home
    Home.config(bg="#aedaf0")
    Home.place(x=550,y=12,width=250,height=75)
 
    Return = Button(StockSearch,image = back,command = lambda: [StockMenu(),StockSearch.destroy()])
    Return.photo = back
    Return.config(bg="#aedaf0")
    Return.place(x=850,y=12,width=250,height=75)
     
    StockID = Label(StockSearch,image=Id)
    StockID.photo= Id
    StockID.config(bg="white")
    StockID.place(x=50,y=100, width = 100, height = 50)
 
    StockIDEnter_Var = StringVar()
 
    StockIDEnter = Entry(StockSearch,textvariable = StockIDEnter_Var)
    StockIDEnter.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    StockIDEnter.place(x=200,y=100,width=250,height=50)
     
    StockName = Label(StockSearch, text = "Stock Name")
    StockName.config(bg="white")
    StockName.place(x=50,y=170,width = 100, height = 50)
 
    StockNameEnter_Var = StringVar()
 
    StockNameEnter = Entry(StockSearch,textvariable = StockNameEnter_Var)
    StockNameEnter.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    StockNameEnter.place(x=200,y=170,width=250,height=50)
     
    StockIDSearch = Button(StockSearch, text = "Search Stock via ID", command = lambda: [ResetStockSearchBox(),SearchStockID()])
    StockIDSearch.configure(font=("Microsoft Sans Serif","8","normal"),bg="white")
    StockIDSearch.place(x=80,y=440,width=300,height=60)
 
    StockNameSearch = Button(StockSearch, text = "Search Stock Via Name", command = lambda: [ResetStockSearchBox(),SearchStockName()])
    StockNameSearch.configure(font=("Microsoft Sans Serif","8","normal"),bg="white")
    StockNameSearch.place(x=80,y=600,width=300,height=60)
 
def StockTransferForm():
     
    global StockTransferbox, StockTransferID_Var, StockTransactionID_Var, TransferPadBox
     
    StockTransfer = Toplevel()
    StockTransfer.geometry("1280x720")
    StockTransfer.config(bg="#aedaf0")
 
    Logoside = Label(StockTransfer,image=logoside)
    Logoside.photo= logoside
    Logoside.config(bg="#aedaf0")
    Logoside.place(x=1230,y=0)
     
    StockTransferbox = Listbox(StockTransfer)
    StockTransferbox.configure(font=("Microsoft Sans Serif","10","normal"),bg="#b1d2e2")
    StockTransferbox.place(x=480,y=100,width=780,height=600)
     
    Home = Button(StockTransfer,image = home,command = lambda: [makeMain(),StockTransfer.destroy()])
    Home.photo = home
    Home.config(bg="#aedaf0")
    Home.place(x=550,y=12,width=250,height=75)
 
    Return = Button(StockTransfer,image = back,command = lambda: [StockMenu(),StockTransfer.destroy()])
    Return.photo = back
    Return.config(bg="#aedaf0")
    Return.place(x=850,y=12,width=250,height=75)
     
    Transfer = Button(StockTransfer, text="Transfer to Parts Used", command = lambda: TransferStock(StockTransferID_Var.get(), StockTransactionID_Var.get()))
    Transfer.config(bg="white")
    Transfer.place(x=50,y=350,width=190,height=50)
     
    StockID = Label(StockTransfer,text="StockID")
    StockID.config(bg="white")
    StockID.place(x=50,y=130,width = 100, height = 50)
 
    StockTransferID_Var = StringVar()
 
    StockIDEntry = Entry(StockTransfer)
    StockIDEntry.configure(text=StockTransferID_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    StockIDEntry.place(x=200,y=130,width=250,height=50)
     
    StockTransactionID = Label(StockTransfer,text="Transaction ID")
    StockTransactionID.config(bg="white")
    StockTransactionID.place(x=50,y=200,width = 100, height = 50)
 
    StockTransactionID_Var = StringVar()
 
    StockTransactionIDEntry = Entry(StockTransfer)
    StockTransactionIDEntry.configure(text=StockTransactionID_Var,font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    StockTransactionIDEntry.place(x=200,y=200,width=250,height=50) 
     
    One = Button(StockTransfer, text = "1", command=lambda: One(TransferPadBox))
    One.config(bg="white")
    One.place(x=50,y=410,width=50,height=50)
     
    Two = Button(StockTransfer, text = "2", command = lambda: Two(TransferPadBox))
    Two.config(bg="white")
    Two.place(x=120,y=410,width=50,height=50)
     
    Three = Button(StockTransfer, text = "3", command = lambda: Three(TransferPadBox))
    Three.config(bg="white")
    Three.place(x=190,y=410,width=50,height=50)
     
    Four = Button(StockTransfer, text = "4", command = lambda: Four(TransferPadBox))
    Four.config(bg="white")
    Four.place(x=50,y=470,width=50,height=50)
     
    Five = Button(StockTransfer, text = "5", command = lambda: Five(TransferPadBox))
    Five.config(bg="white")
    Five.place(x=120,y=470,width=50,height=50)
     
    Six = Button(StockTransfer, text = "6", command = lambda: Six(TransferPadBox))
    Six.config(bg="white")
    Six.place(x=190,y=470,width=50,height=50)
     
    Seven = Button(StockTransfer, text = "7", command = lambda: Seven(TransferPadBox))
    Seven.config(bg="white")
    Seven.place(x=50,y=530,width=50,height=50)
     
    Eight = Button(StockTransfer, text = "8", command = lambda: Eight(TransferPadBox))
    Eight.config(bg="white")
    Eight.place(x=120,y=530,width=50,height=50)
     
    Nine = Button(StockTransfer, text = "9", command = lambda: Nine(TransferPadBox))
    Nine.config(bg="white")
    Nine.place(x=190,y=530,width=50,height=50)
     
    Zero = Button(StockTransfer, text = "0", command = lambda: Zero(TransferPadBox))
    Zero.config(bg="white")
    Zero.place(x=120,y=590,width=50,height=50)
     
     
    Reset = Button(StockTransfer, text = "Reset-", command = lambda: Clear(TransferPadBox))
    Reset.config(bg="white")
    Reset.place(x=310,y=470,width=100,height=50)
     
    TransferPadBox = Entry(StockTransfer)
    TransferPadBox.configure(font=("Microsoft Sans Serif","16","normal"),bg="#b1d2e2")
    TransferPadBox.place(x=260,y=410,width=200,height=50)
 

     
    def One(TransferPadBox):
        TransferPadBox.insert(END, "1")
    def Two(TransferPadBox):
        TransferPadBox.insert(END, "2")   
    def Three(TransferPadBox):
        TransferPadBox.insert(END, "3")
    def Four(TransferPadBox):
        TransferPadBox.insert(END, "4")
    def Five(TransferPadBox):
        TransferPadBox.insert(END, "5")
    def Six(TransferPadBox):
        TransferPadBox.insert(END, "6")
    def Seven(TransferPadBox):
        TransferPadBox.insert(END, "7")
    def Eight(TransferPadBox):
        TransferPadBox.insert(END, "8")
    def Nine(TransferPadBox):
        TransferPadBox.insert(END, "9")
    def Zero(TransferPadBox):
        TransferPadBox.insert(END, "0")
    def Clear(TransferPadBox):
        TransferPadBox.delete(0, END) 
 
def UsedpartsSearchForm():
     
    global UsedStockSearchBox, StockTranIDEnter_Var, TotalCostBox
     
    UsedStockSearch = Toplevel()
    UsedStockSearch.geometry("1280x720")
    UsedStockSearch.config(bg="#aedaf0")
 
    Logoside = Label(UsedStockSearch,image=logoside)
    Logoside.photo= logoside
    Logoside.config(bg="#aedaf0")
    Logoside.place(x=1230,y=0)
 
    Logomain = Label(UsedStockSearch,image=logomain)
    Logomain.photo = logomain
    Logomain.config(bg="#aedaf0")
    Logomain.place(x=20,y=300)
 
    UsedStockSearchBox = Listbox(UsedStockSearch)
    UsedStockSearchBox.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    UsedStockSearchBox.place(x=460,y=100,width=800,height=600)
 
    Home = Button(UsedStockSearch,image = home,command = lambda: [makeMain(),UsedStockSearch.destroy()])
    Home.photo = home
    Home.config(bg="#aedaf0")
    Home.place(x=550,y=12,width=250,height=75)
 
    Return = Button(UsedStockSearch,image = back,command = lambda: [StockMenu(),UsedStockSearch.destroy()])
    Return.photo = back
    Return.config(bg="#aedaf0")
    Return.place(x=850,y=12,width=250,height=75)
     
    StockTranID = Label(UsedStockSearch,image=Id)
    StockTranID.photo= Id
    StockTranID.config(bg="white")
    StockTranID.place(x=50,y=100, width = 100, height = 50)
 
    StockTranIDEnter_Var = StringVar()
 
    StockTranIDEnter = Entry(UsedStockSearch,textvariable = StockTranIDEnter_Var)
    StockTranIDEnter.configure(font=("Microsoft Sans Serif","8","normal"),bg="#b1d2e2")
    StockTranIDEnter.place(x=200,y=100,width=250,height=50)
     
    StockTranIDSearch = Button(UsedStockSearch,text = "Search Via Transaction ID",command = lambda: [ResetUsedStockSearchBox(),UsedTransSearch()])
    StockTranIDSearch.config(bg="white")
    StockTranIDSearch.place(x=200,y=170,width=250,height=75)
     
    CalctotalCost = Button(UsedStockSearch,text = "Calculate Total Cost",command = lambda: [ResetTotalCostBox(),CalcTotal(StockTranIDEnter_Var.get())])
    CalctotalCost.config(bg="white")
    CalctotalCost.place(x=50,y=620,width=250,height=75)
     
    TotalCostBox = Listbox(UsedStockSearch)
    TotalCostBox.configure(font=("Microsoft Sans Serif","16","normal"),bg="#b1d2e2")
    TotalCostBox.place(x=50,y=550,width=350,height=50)
     
     
         
def Root():
    Root = Tk()
    Root.geometry("200x100")
    Root.config(bg="#d52327")
 
    QuitButton = PhotoImage(file="Quit.png")
 
    Quit = Button(Root, image = QuitButton, command = quit)
    Quit.configure(bg="#d52327")
    Quit.Photo = QuitButton
    Quit.place(x=0,y=0,width=200,height=100)
 
    makeMain()
 
    return Root
 
Root()
